[{"context": "Automatic Locally Robust Estimation with Generated Regressors", "source": "Many economic and causal parameters of interest depend on generated regressors. Examples include structural parameters in models with endogenous variables estimated by control functions and in models with sample selection, treatment effect estimation with propensity score matching, and marginal treatment effects. Inference with generated regressors is complicated by the very complex expression for influence functions and asymptotic variances. To address this problem, we propose Automatic Locally Robust/debiased GMM estimators in a general setting with generated regressors. Importantly, we allow for the generated regressors to be generated from machine learners, such as Random Forest, Neural Nets, Boosting, and many others. We use our results to construct novel Doubly Robust and Locally Robust estimators for the Counterfactual Average Structural Function and Average Partial Effects in models with endogeneity and sample selection, respectively. We provide sufficient conditions for the asymptotic normality of our debiased GMM estimators and investigate their finite sample performance through Monte Carlo simulations.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2301.10643}, {"context": "Posterior-Mean Separable Costs of Information Acquisition", "source": "We analyze a problem of revealed preference given state-dependent stochastic choice data in which the payoff to a decision maker (DM) only depends on their beliefs about posterior means. Often, the DM must also learn about or pay attention to the state; in applied work on this subject, a convenient assumption is that the costs of such learning are linearly dependent in the distribution over posterior means. We provide testable conditions to identify whether this assumption holds. This allows for the use of information design techniques to solve the DM's problem.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.09496}, {"context": "Locally Asymptotically Minimax Statistical Treatment Rules Under Partial\n  Identification", "source": "Policymakers often desire a statistical treatment rule (STR) that determines a treatment assignment rule deployed in a future population from available data. With the true knowledge of the data generating process, the average treatment effect (ATE) is the key quantity characterizing the optimal treatment rule. Unfortunately, the ATE is often not point identified but partially identified. Presuming the partial identification of the ATE, this study conducts a local asymptotic analysis and develops the locally asymptotically minimax (LAM) STR. The analysis does not assume the full differentiability but the directional differentiability of the boundary functions of the identification region of the ATE. Accordingly, the study shows that the LAM STR differs from the plug-in STR. A simulation study also demonstrates that the LAM STR outperforms the plug-in STR.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.08958}, {"context": "Decomposability and Strategy-proofness in Multidimensional Models", "source": "We introduce the notion of a multidimensional hybrid preference domain on a (finite) set of alternatives that is a Cartesian product of finitely many components. We demonstrate that in a model of public goods provision, multidimensional hybrid preferences arise naturally through assembling marginal preferences under the condition of semi-separability - a weakening of separability. The main result shows that under a suitable \"richness\" condition, every strategy-proof rule on this domain can be decomposed into component-wise strategy-proof rules, and more importantly every domain of preferences that reconciles decomposability of rules with strategy-proofness must be a multidimensional hybrid domain.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2303.10889}, {"context": "Considering Risk Aversion in Economic Evaluation: A Rank Dependent\n  Approach", "source": "This paper presents a method for incorporating risk aversion into existing decision tree models used in economic evaluations. The method involves applying a probability weighting function based on rank dependent utility theory to reduced lotteries in the decision tree model. This adaptation embodies the fact that different decision makers can observe the same decision tree model structure but come to different conclusions about the optimal treatment. The proposed solution to this problem is to compensate risk-averse decision makers to use the efficient technology that they are reluctant to adopt.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.07905}, {"context": "Belief identification by proxy", "source": "It is well known that individual beliefs cannot be identified using traditional choice data, unless we exogenously assume state-independent utilities. In this paper, I propose a novel methodology that solves this long-standing identification problem in a simple way. This method relies on the extending the state space by introducing a proxy, for which the agent has no stakes conditional on the original state space. The latter allows us to identify the agent's conditional beliefs about the proxy given each state realization, which in turn suffices for indirectly identifying her beliefs about the original state space. This approach is analogous to the one of instrumental variables in econometrics. Similarly to instrumental variables, the appeal of this method comes from the flexibility in selecting a proxy.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.13394}, {"context": "Optimal Estimation Methodologies for Panel Data Regression Models", "source": "This survey study discusses main aspects to optimal estimation methodologies for panel data regression models. In particular, we present current methodological developments for modeling stationary panel data as well as robust methods for estimation and inference in nonstationary panel data regression models. Some applications from the network econometrics and high dimensional statistics literature are also discussed within a stationary time series environment.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.03471}, {"context": "Heterogeneity-robust granular instruments", "source": "Granular instrumental variables (GIV) has experienced sharp growth in empirical macro-finance. The methodology's rise showcases granularity's potential for identification in a wide set of economic environments, like the estimation of spillovers and demand systems. I propose a new estimator--called robust granular instrumental variables (RGIV)--that allows researchers to study unit-level heterogeneity in spillovers within GIV's framework. In contrast to GIV, RGIV also allows for unknown shock variances and does not require skewness of the size distribution of units. I also develop a test of overidentifying restrictions that evaluates RGIV's compatibility with the data, a parameter restriction test that evaluates the appropriateness of the homogeneous spillovers assumption, and extend the framework to allow for observable explanatory variables. Applied to the Euro area, I find strong evidence of country-level heterogeneity in sovereign yield spillovers. In simulations, I show that RGIV produces reliable and informative confidence intervals.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2304.01273}, {"context": "The Complexity of Corporate Culture as a Potential Source of Firm Profit\n  Differentials", "source": "This paper proposes an addition to the firm-based perspective on intra-industry profitability differentials by modelling a business organisation as a complex adaptive system. The presented agent-based model introduces an endogenous similarity-based social network and employees' reactions to dynamic management strategies informed by key company benchmarks. The value-based decision-making of employees shapes the behaviour of others through their perception of social norms from which a corporate culture emerges. These elements induce intertwined feedback mechanisms which lead to unforeseen profitability outcomes. The simulations reveal that variants of extreme adaptation of management style yield higher profitability in the long run than the more moderate alternatives. Furthermore, we observe convergence towards a dominant management strategy with low intensity in monitoring efforts as well as high monetary incentivisation of cooperative behaviour. The results suggest that measures increasing the connectedness of the workforce across all four value groups might be advisable to escape potential lock-in situation and thus raise profitability. A further positive impact on profitability can be achieved through knowledge about the distribution of personal values among a firm's employees. Choosing appropriate and enabling management strategies, and sticking to them in the long run, can support the realisation of the inherent self-organisational capacities of the workforce, ultimately leading to higher profitability through cultural stability.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2305.14029}, {"context": "Stable partitions for proportional generalized claims problems", "source": "We consider a set of agents who have claims on an endowment that is not large enough to cover all claims. Agents can form coalitions but a minimal coalition size $\\theta$ is required to have positive coalitional funding that is proportional to the sum of the claims of its members. We analyze the structure of stable partitions when coalition members use well-behaved rules to allocate coalitional endowments, e.g., the well-known constrained equal awards rule (CEA) or the constrained equal losses rule (CEL).For continuous, (strictly) resource monotonic, and consistent rules, stable partitions with (mostly) $\\theta$-size coalitions emerge. For CEA and CEL we provide algorithms to construct such a stable partition formed by $\\theta$-size coalitions.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.0395}]