[{"context": "Debiased Fixed Effects Estimation of Binary Logit Models with\n  Three-Dimensional Panel Data", "source": "Naive maximum likelihood estimation of binary logit models with fixed effects leads to unreliable inference due to the incidental parameter problem. We study the case of three-dimensional panel data, where the model includes three sets of additive and overlapping unobserved effects. This encompasses models for network panel data, where senders and receivers maintain bilateral relationships over time, and fixed effects account for unobserved heterogeneity at the sender-time, receiver-time, and sender-receiver levels. In an asymptotic framework, where all three panel dimensions grow large at constant relative rates, we characterize the leading bias of the naive estimator. The inference problem we identify is particularly severe, as it is not possible to balance the order of the bias and the standard deviation. As a consequence, the naive estimator has a degenerating asymptotic distribution, which exacerbates the inference problem relative to other fixed effects estimators studied in the literature. To resolve the inference problem, we derive explicit expressions to debias the fixed effects estimator.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.04073}, {"context": "Semiparametric Discrete Choice Models for Bundles", "source": "We propose two approaches to estimate semiparametric discrete choice models for bundles. Our first approach is a kernel-weighted rank estimator based on a matching-based identification strategy. We establish its complete asymptotic properties and prove the validity of the nonparametric bootstrap for inference. We then introduce a new multi-index least absolute deviations (LAD) estimator as an alternative, of which the main advantage is its capacity to estimate preference parameters on both alternative- and agent-specific regressors. Both methods can account for arbitrary correlation in disturbances across choices, with the former also allowing for interpersonal heteroskedasticity. We also demonstrate that the identification strategy underlying these procedures can be extended naturally to panel data settings, producing an analogous localized maximum score estimator and a LAD estimator for estimating bundle choice models with fixed effects. We derive the limiting distribution of the former and verify the validity of the numerical bootstrap as an inference tool. All our proposed methods can be applied to general multi-index models. Monte Carlo experiments show that they perform well in finite samples.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2306.04135}, {"context": "Mechanism Design without Rational Expectations", "source": "Is incentive compatibility still necessary for implementation if we relax the rational expectations assumption? This paper proposes a generalized model of implementation that does not assume agents hold rational expectations and characterizes the class of solution concepts requiring Bayesian Incentive Compatibility (BIC) for full implementation. Surprisingly, for a broad class of solution concepts, full implementation of functions still requires BIC even if rational expectations do not hold. This finding implies that some classical results, such as the impossibility of efficient bilateral trade (Myerson & Satterthwaite, 1983), hold for a broader range of non-equilibrium solution concepts, confirming their relevance even in boundedly rational setups.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2305.07472}, {"context": "Underreaction and dynamic inconsistency in communication games under\n  noise", "source": "Communication is rarely perfect, but rather prone to error of transmission and reception. Often the origin of these errors cannot be properly quantified and is thus imprecisely known. We analyze the impact of an ambiguous noise which may alter the received message on a communication game of common interest. The noise is ambiguous in the sense that the parameters of the error-generating process and thus the likelihood to receive a message by mistake are Knightianly unknown. Ex-ante and interim responses are characterized under maxmin preferences. While the sender can disregard ambiguity, the receiver reveals a dynamically inconsistent, but astonishing behavior under a quadratic loss. Their interim actions will be closer to the pooling action than their ex-ante ones, as if facing a higher likelihood of an occurring error.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.12496}, {"context": "Causal inference in network experiments: regression-based analysis and\n  design-based properties", "source": "Investigating interference or spillover effects among units is a central task in many social science problems. Network experiments are powerful tools for this task, which avoids endogeneity by randomly assigning treatments to units over networks. However, it is non-trivial to analyze network experiments properly without imposing strong modeling assumptions. Previously, many researchers have proposed sophisticated point estimators and standard errors for causal effects under network experiments. We further show that regression-based point estimators and standard errors can have strong theoretical guarantees if the regression functions and robust standard errors are carefully specified to accommodate the interference patterns under network experiments. We first recall a well-known result that the Hajek estimator is numerically identical to the coefficient from the weighted-least-squares fit based on the inverse probability of the exposure mapping. Moreover, we demonstrate that the regression-based approach offers three notable advantages: its ease of implementation, the ability to derive standard errors through the same weighted-least-squares fit, and the capacity to integrate covariates into the analysis, thereby enhancing estimation efficiency. Furthermore, we analyze the asymptotic bias of the regression-based network-robust standard errors. Recognizing that the covariance estimator can be anti-conservative, we propose an adjusted covariance estimator to improve the empirical coverage rates. Although we focus on regression-based point estimators and standard errors, our theory holds under the design-based framework, which assumes that the randomness comes solely from the design of network experiments and allows for arbitrary misspecification of the regression models.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2309.07476}, {"context": "Locally Asymptotically Minimax Statistical Treatment Rules Under Partial\n  Identification", "source": "Policymakers often desire a statistical treatment rule (STR) that determines a treatment assignment rule deployed in a future population from available data. With the true knowledge of the data generating process, the average treatment effect (ATE) is the key quantity characterizing the optimal treatment rule. Unfortunately, the ATE is often not point identified but partially identified. Presuming the partial identification of the ATE, this study conducts a local asymptotic analysis and develops the locally asymptotically minimax (LAM) STR. The analysis does not assume the full differentiability but the directional differentiability of the boundary functions of the identification region of the ATE. Accordingly, the study shows that the LAM STR differs from the plug-in STR. A simulation study also demonstrates that the LAM STR outperforms the plug-in STR.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.08958}, {"context": "Stable partitions for proportional generalized claims problems", "source": "We consider a set of agents who have claims on an endowment that is not large enough to cover all claims. Agents can form coalitions but a minimal coalition size $\\theta$ is required to have positive coalitional funding that is proportional to the sum of the claims of its members. We analyze the structure of stable partitions when coalition members use well-behaved rules to allocate coalitional endowments, e.g., the well-known constrained equal awards rule (CEA) or the constrained equal losses rule (CEL).For continuous, (strictly) resource monotonic, and consistent rules, stable partitions with (mostly) $\\theta$-size coalitions emerge. For CEA and CEL we provide algorithms to construct such a stable partition formed by $\\theta$-size coalitions.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.0395}, {"context": "Estimating Functionals of the Joint Distribution of Potential Outcomes\n  with Optimal Transport", "source": "Many causal parameters depend on a moment of the joint distribution of potential outcomes. Such parameters are especially relevant in policy evaluation settings, where noncompliance is common and accommodated through the model of Imbens & Angrist (1994). This paper shows that the sharp identified set for these parameters is an interval with endpoints characterized by the value of optimal transport problems. Sample analogue estimators are proposed based on the dual problem of optimal transport. These estimators are root-n consistent and converge in distribution under mild assumptions. Inference procedures based on the bootstrap are straightforward and computationally convenient. The ideas and estimators are demonstrated in an application revisiting the National Supported Work Demonstration job training program. I find suggestive evidence that workers who would see below average earnings without treatment tend to see above average benefits from treatment.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.09435}, {"context": "High Dimensional Binary Choice Model with Unknown Heteroskedasticity or\n  Instrumental Variables", "source": "This paper proposes a new method for estimating high-dimensional binary choice models. The model we consider is semiparametric, placing no distributional assumptions on the error term, allowing for heteroskedastic errors, and permitting endogenous regressors. Our proposed approaches extend the special regressor estimator originally proposed by Lewbel (2000). This estimator becomes impractical in high-dimensional settings due to the curse of dimensionality associated with high-dimensional conditional density estimation. To overcome this challenge, we introduce an innovative data-driven dimension reduction method for nonparametric kernel estimators, which constitutes the main innovation of this work. The method combines distance covariance-based screening with cross-validation (CV) procedures, rendering the special regressor estimation feasible in high dimensions. Using the new feasible conditional density estimator, we address the variable and moment (instrumental variable) selection problems for these models. We apply penalized least squares (LS) and Generalized Method of Moments (GMM) estimators with a smoothly clipped absolute deviation (SCAD) penalty. A comprehensive analysis of the oracle and asymptotic properties of these estimators is provided. Monte Carlo simulations are employed to demonstrate the effectiveness of our proposed procedures in finite sample scenarios.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.07067}, {"context": "Semiparametric Discrete Choice Models for Bundles", "source": "We propose two approaches to estimate semiparametric discrete choice models for bundles. Our first approach is a kernel-weighted rank estimator based on a matching-based identification strategy. We establish its complete asymptotic properties and prove the validity of the nonparametric bootstrap for inference. We then introduce a new multi-index least absolute deviations (LAD) estimator as an alternative, of which the main advantage is its capacity to estimate preference parameters on both alternative- and agent-specific regressors. Both methods can account for arbitrary correlation in disturbances across choices, with the former also allowing for interpersonal heteroskedasticity. We also demonstrate that the identification strategy underlying these procedures can be extended naturally to panel data settings, producing an analogous localized maximum score estimator and a LAD estimator for estimating bundle choice models with fixed effects. We derive the limiting distribution of the former and verify the validity of the numerical bootstrap as an inference tool. All our proposed methods can be applied to general multi-index models. Monte Carlo experiments show that they perform well in finite samples.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.00013}]