[{"context": "On bifurcations of symmetric elliptic orbits", "source": "We study bifurcations of symmetric elliptic fixed points in the case of \\emph{p}:\\emph{q} resonances with odd $q\\geq 3$. We consider the case where the initial area-preserving map $\\bar z =\\lambda z + Q(z,z^*)$ possesses the central symmetry, i.e. is invariant under the change $z\\to -z$, $z^*\\to -z^*$. We construct normal forms for such maps in the case $\\lambda = e^{i 2\\pi \\frac{p}{q}}$, where $p$ and $q$ are mutually prime integer numbers, $p\\leq q$ and $q$ is odd, and study local bifurcations of the fixed point $z=0$ in various settings. We prove the appearance of garlands consisting of four $q$-periodic orbits, two orbits are elliptic and two orbits are saddle, and describe the corresponding bifurcation diagrams for one- and two-parameter families. We also consider the case where the initial map is reversible and find conditions when non-symmetric periodic orbits of the garlands are non-conservative (compose symmetric pairs of stable and unstable orbits as well as area-contracting and area-expanding saddles).", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.06599}, {"context": "Linearized Analysis of Adiabatic Oscillations of Rotating Gaseous Stars", "source": "We study adiabatic oscillations of rotating self-gravitating gaseous stars in mathematically rigorous manner. The internal motion of the star is supposed to be governed by the Euler-Poisson equations with rotation of constant angular velocity under the equation of state of the ideal gas. The motion is supposed to be adiabatic, but not to be barotropic in general. This causes a free boundary problem to gas-vacuum interface. Existence of solutions to the linearized equation in the Lagrange coordinates of the perturbations around a fixed stationary solution, the eigenvalue problem with concept of quadratic pencil of operators, and the stability problem with a new concept of stability introduced in this article are discussed.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2309.00521}, {"context": "Gaussian Volterra processes as models of electricity markets", "source": "We introduce a non-Markovian model for electricity markets where the spot price of electricity is driven by several Gaussian Volterra processes, which can be e.g., fractional Brownian motions (fBms), Riemann-Liouville processes or Gaussian-Volterra driven Ornstein-Uhlenbeck processes. Since in energy markets the spot price is not a tradeable asset, due to the limited storage possibilities, forward contracts are considered as traded products. We ensure necessary and sufficient conditions for the absence of arbitrage that, in this kind of market, reflects the fact that the prices of the forward contracts are (Gaussian) martingales under a risk-neutral measure. Moreover, we characterize the market completeness in terms of the number of forward contracts simultaneously considered and of the kernels of the Gaussian-Volterra processes. Then, we formulate a portfolio optimization problem for an agent who invests in an electricity market, and we solve it explicitly in the case of CRRA utility functions. We also find closed formula for the price of options written on forward contracts, together with the hedging strategy. Finally, we provide a novel representation of Ornstein-Uhlenbeck (OU) processes driven by Gaussian Volterra processes. Also exploiting this result, we show analytically that, for some kinds of Gaussian-Volterra processes driving the spot prices, under conditions ensuring the absence of arbitrage, the market is complete.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.09384}, {"context": "On some structural properties of evolution algebras", "source": "We consider the intersection $\\mathfrak{M}(A)$ of all maximal ideals of an evolution algebra $A$ and study the structure of the quotient $A/\\M(A)$. In a previous work, maximal ideals have been related to hereditary subsets of a graph associated to the given algebra. We investigate the superfluous members both in the family of maximal ideals and also in the set of hereditary subsets of the associated graphs. By using subdirect products we state a structure theorem for arbitrary evolution algebras (arbitrary dimensions and ground field). Specializing in the perfect finite-dimensional case, we obtain a direct sum decomposition instead of a subdirect product and also a uniqueness property. We also study some examples in which Grassmanians appear in a natural way and others that exhibit a richer structure with a nonzero semisimple part that is non-associative.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.00102}, {"context": "On the maximum $A_{\\alpha}$-spectral radius of unicyclic and bicyclic\n  graphs with fixed girth or fixed number of pendant vertices", "source": "For a connected graph $G$, let $A(G)$ be the adjacency matrix of $G$ and $D(G)$ be the diagonal matrix of the degrees of the vertices in $G$. The $A_{\\alpha}$-matrix of $G$ is defined as \\begin{align*} A_\\alpha (G) = \\alpha D(G) + (1-\\alpha) A(G) \\quad \\text{for any $\\alpha \\in [0,1]$}. \\end{align*}   The largest eigenvalue of $A_{\\alpha}(G)$ is called the $A_{\\alpha}$-spectral radius of $G$. In this article, we characterize the graphs with maximum $A_{\\alpha}$-spectral radius among the class of unicyclic and bicyclic graphs of order $n$ with fixed girth $g$. Also, we identify the unique graphs with maximum $A_{\\alpha}$-spectral radius among the class of unicyclic and bicyclic graphs of order $n$ with $k$ pendant vertices.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.13364}, {"context": "The Navier-Stokes equations on manifolds with boundary", "source": "We consider the motion of an incompressible viscous fluid on a compact Riemannian manifold $\\sM$ with boundary. The motion on $\\sM$ is modeled by the incompressible Navier-Stokes equations, and the fluid is subject to pure or partial slip boundary conditions of Navier type on $\\partial\\sM$. We establish existence and uniqueness of strong as well as weak (variational) solutions for initial data in critical spaces. Moreover, we show that the set of equilibria consists of Killing vector fields on $\\sM$ that satisfy corresponding boundary conditions, and we prove that all equilibria are (locally) stable. In case $\\sM$ is two-dimensional we show that solutions with divergence free initial condition in $L_2(\\sM; T\\sM)$ exist globally and converge to an equilibrium exponentially fast.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.01221}, {"context": "Pseudo-isotopies of simply connected 4-manifolds", "source": "Perron and Quinn gave independent proofs in 1986 that every topological pseudo-isotopy of a simply-connected, compact topological 4-manifold is isotopic to the identity. Another result of Quinn is that every smooth pseudo-isotopy of a simply-connected, compact, smooth 4-manifold is smoothly stably isotopic to the identity. From this he deduced that $\\pi_4(\\operatorname{TOP}(4)/\\operatorname{O}(4)) =0$. A replacement criterion is used at a key juncture in Quinn's proofs, but the justification given for it is incorrect. We provide different arguments that bypass the replacement criterion, thus completing Quinn's proofs of both the topological and the stable smooth pseudo-isotopy theorems. We discuss the replacement criterion and state it as an open problem.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.11196}, {"context": "On Risk Evaluation and Control of Distributed Multi-Agent Systems", "source": "In this paper, we deal with risk evaluation and risk-averse optimization of complex distributed systems with general risk functionals. We postulate a novel set of axioms for the functionals evaluating the total risk of the system. We derive a dual representation for the systemic risk measures and propose a way to construct non-trivial families of measures by using either a collection of linear scalarizations or non-linear risk aggregation. The new framework facilitates risk-averse sequential decision-making by distributed methods. The proposed approach is compared theoretically and numerically to some of the systemic risk measurements in the existing literature.   We formulate a two-stage decision problem with monotropic structure and systemic measure of risk. The structure is typical for distributed systems arising in energy networks, robotics, and other practical situations. A distributed decomposition method for solving the two-stage problem is proposed and it is applied to a problem arising in communication networks. We have used this problem to compare the methods of systemic risk evaluation. We show that the proposed risk aggregation leads to less conservative risk evaluation and results in a substantially better solution of the problem at hand as compared to an aggregation of the risk of individual agents and other methods.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.10287}, {"context": "Equality of different definitions of conformal dimension for\n  quasiself-similar and CLP spaces", "source": "We prove that for a quasiself-similar and arcwise connected compact metric space all three known versions of the conformal dimension coincide: the conformal Hausdorff dimension, conformal Assouad dimension and Ahlfors regular conformal dimension. This answers a question posed by Mathav Murugan. Quasisimilar spaces include all approximately self-similar spaces. As an example, the standard Sierpi\\'nski carpet is quasiself-similar and thus the three notions of conformal dimension coincide for it.   We also give the equality of the three dimensions for combinatorially $p$-Loewner (CLP) spaces. Both proofs involve using a new notion of combinatorial modulus, which lies between two notions of modulus that have appeared in the literature. The first of these is the modulus studied by Pansu and Tyson, which uses a Carath\\'eodory construction. The second is the one used by Keith and Laakso (and later modified and used by Bourdon, Kleiner, Carrasco-Piaggio, Murugan and Shanmugalingam). By combining these approaches, we gain the flexibility of giving upper bounds for the new modulus from the Pansu-Tyson approach, and the ability of getting lower bounds using the Keith-Laakso approach. Additionally the new modulus can be iterated in self-similar spaces, which is a crucial, and novel, step in our argument.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2309.11447}, {"context": "Reconstruction of degenerate conductivity region for parabolic equations", "source": "We consider an inverse problem of reconstructing a degeneracy point in the diffusion coefficient in a one-dimensional parabolic equation by measuring the normal derivative on one side of the domain boundary. We analyze the sensitivity of the inverse problem to the initial data. We give sufficient conditions on the initial data for uniqueness and stability for the one-point measurement and show some examples of positive and negative results. On the other hand, we present more general uniqueness results, also for the identification of an initial data by measurements distributed over time. The proofs are based on an explicit form of the solution by means of Bessel functions of the first type. Finally, the theoretical results are supported by numerical experiments.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.09863}]