[{"context": "A Classification of Asymptotic Behaviors of Green Functions of Random\n  Walks in the Quadrant", "source": "This paper investigates the asymptotic behavior of Green functions associated to partially homogeneous random walks in the quadrant $Z_+^2$. There are four possible distributions for the jumps of these processes, depending on the location of the starting point: in the interior, on the two positive axes of the boundary, and at the origin $(0,0)$.   With mild conditions on the positive jumps of the random walk, which can be unbounded, a complete analysis of the asymptotic behavior of the Green function of the random walk killed at $(0,0)$ is achieved. The main result is that {\\em eight} regions of the set of parameters determine completely the possible limiting behaviors of Green functions of these Markov chains. These regions are defined by a set of relations for several characteristics of the distributions of the jumps.   In the transient case, a description of the Martin boundary is obtained and in the positive recurrent case, our results give the exact limiting behavior of the invariant distribution of a state whose norm goes to infinity along some asymptotic direction in the quadrant. These limit theorems extend results of the literature obtained, up to now, essentially for random walks whose jump sizes are either $0$ or $1$ on each coordinate.   Our approach relies on a combination of several methods: probabilistic representations of solutions of analytical equations, Lyapounov functions, convex analysis, methods of homogeneous random walks, and complex analysis arguments.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.06652}, {"context": "The Distribution of Sandpile Groups of Random Graphs with their Pairings", "source": "We determine the distribution of the sandpile group (also known as the Jacobian) of the Erd\\H{o}s-R\\&#x27;{e}nyi random graph $G(n,q)$ along with its canonical duality pairing as $n$ tends to infinity, fully resolving a conjecture from 2015 due to Clancy, Leake, and Payne and generalizing the result by Wood on the groups. In particular, we show that a finite abelian $p$-group $G$ equipped with a perfect symmetric pairing $\\delta$ appears as the Sylow $p$-part of the sandpile group and its pairing with frequency inversely proportional to $|G||\\mathrm{Aut}(G,\\delta)|$, where $\\mathrm{Aut}(G,\\delta)$ is the set of automorphisms of $G$ preserving the pairing $\\delta$. While this distribution is related to the Cohen-Lenstra distribution, the two distributions are not the same on account of the additional algebraic data of the pairing. The proof utilizes the moment method: we first compute a complete set of moments for our random variable (the average number of epimorphisms from our random object to a fixed object in the category of interest) and then show the moments determine the distribution. To obtain the moments, we prove a universality result for the moments of cokernels of random symmetric integral matrices whose dual groups are equipped with symmetric pairings that is strong enough to handle both the dependence in the diagonal entries and the additional data of the pairing. We then apply results due to Sawin and Wood to show that these moments determine a unique distribution.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.07078}, {"context": "Topological and control theoretic properties of Hamilton-Jacobi\n  equations via Lax-Oleinik commutators", "source": "In the context of weak KAM theory, we discuss the commutators $\\{T^-_t\\circ T^+_t\\}_{t\\geqslant0}$ and $\\{T^+_t\\circ T^-_t\\}_{t\\geqslant0}$ of Lax-Oleinik operators. We characterize the relation $T^-_t\\circ T^+_t=Id$ for both small time and arbitrary time $t$. We show this relation characterizes controllability for evolutionary Hamilton-Jacobi equation. Based on our previous work on the cut locus of viscosity solution, we refine our analysis of the cut time function $\\tau$ in terms of commutators $T^+_t\\circ T^-_t-T^+_t\\circ T^-_t$ and clarify the structure of the super/sub-level set of the cut time function $\\tau$.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.07}, {"context": "On the number of subdirect products involving semigroups of integers and\n  natural numbers", "source": "We extend a recent result that for the (additive) semigroup of positive integers $\\mathbb{N}$, there are continuum many subdirect products of $\\mathbb{N} \\times \\mathbb{N}$ up to isomorphism. We prove that for $U,V$ each one of $\\mathbb{Z}$ (the group of integers), $\\mathbb{N}_{0}$ (the monoid of non-negative integers), or $\\mathbb{N}$, we prove that $U \\times V$ has continuum many (semigroup) subdirect products up to isomorphism.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.04994}, {"context": "The matroid of a graphing", "source": "Graphings serve as limit objects for bounded-degree graphs. We define the ``cycle matroid&#x27;&#x27; of a graphing as a submodular setfunction, with values in [0,1], which generalizes (up to normalization) the cycle matroid of finite graphs. We prove that for a Benjamini--Schramm convergent sequence of graphs, the total rank, normalized by the number of nodes, converges to the total rank of the limit graphing.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.03868}, {"context": "On uniformly quasiconformal Anosov diffeomorphisms with two dimensional\n  distributions", "source": "We prove that a transitive uniformly $u$-quasiconformal Anosov diffeomorphism with a two-dimensional unstable distribution has a globally defined stable holonomy. As a corollary, we are able to remove an additional assumption in a theorem of Kalinin-Sadovskaya, and deduce that all transitive uniformly quasiconformal Anosov diffeomorphisms are $C^{\\infty}$-conjugate to affine Anosov diffeomorphisms on infra-torus.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.00251}, {"context": "An alternate proof of Payan's theorem on cubelike graphs", "source": "A cubelike graph is a Cayley graph on the product $\\mathbb{Z}_2\\times\\cdots\\times\\mathbb{Z}_2$ of the integers modulo $2$ with itself finitely many times. In 1992, Payan proved that no cubelike graph can have chromatic number $3$. The authors of the present paper previously developed a general matrix method for studying chromatic numbers of Cayley graphs on abelian groups. In this note, we apply this method of Heuberger matrices to give an alternate proof of Payan&#x27;s theorem.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2303.06267}, {"context": "Approximation by polynomials with constant coefficients and the\n  Thresholding Greedy Algorithm", "source": "Greedy bases are those bases where the Thresholding Greedy Algorithm (introduced by S. V. Konyagin and V. N. Temlyakov) produces the best possible approximation up to a constant. In 2017, Bern\\&#x27;a and Blasco gave a characterization of these bases using polynomials with constant coefficients. In this paper, we continue this study improving some optimization problems and extending some results to the context of quasi-Banach spaces.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2309.14607}, {"context": "Irreducibility of some crystalline loci with irregular Hodge--Tate\n  weights", "source": "We show that loci of crystalline representations of $G_K$ for $K/\\mathbb{Q}_p$ an unramified extension are irreducible when the Hodge--Tate weights are fixed and sufficiently small. This was previously known for weights in the interval $[-p,0]$ and in this paper we show how that this bound can be relaxed provided the Hodge--Tate weights are sufficiently irregular at certain embeddings. This is motivated by the desire to extend the conjectures of Breuil--M\\&#x27;ezard on loci of potentially crystalline representations to irregular weights.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.11989}, {"context": "Torsion and twists of abelian varieties", "source": "In this article, we investigate the possible torsion subgroups of twists of abelian varieties with good reduction. As an application, we prove a theorem concerning ramified primes over any quadratic extension where odd-order torsion growth is achieved. In particular, we show that for every rational elliptic curve and every imaginary quadratic field not equal to $\\mathbb{Q}(\\sqrt{-3})$ satisfying the Heegner hypothesis no odd-order torsion growth can occur.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2310.11086}]