[{"context": "A Classification of Asymptotic Behaviors of Green Functions of Random\n  Walks in the Quadrant", "source": "This paper investigates the asymptotic behavior of Green functions associated to partially homogeneous random walks in the quadrant $Z_+^2$. There are four possible distributions for the jumps of these processes, depending on the location of the starting point: in the interior, on the two positive axes of the boundary, and at the origin $(0,0)$.   With mild conditions on the positive jumps of the random walk, which can be unbounded, a complete analysis of the asymptotic behavior of the Green function of the random walk killed at $(0,0)$ is achieved. The main result is that {\\em eight} regions of the set of parameters determine completely the possible limiting behaviors of Green functions of these Markov chains. These regions are defined by a set of relations for several characteristics of the distributions of the jumps.   In the transient case, a description of the Martin boundary is obtained and in the positive recurrent case, our results give the exact limiting behavior of the invariant distribution of a state whose norm goes to infinity along some asymptotic direction in the quadrant. These limit theorems extend results of the literature obtained, up to now, essentially for random walks whose jump sizes are either $0$ or $1$ on each coordinate.   Our approach relies on a combination of several methods: probabilistic representations of solutions of analytical equations, Lyapounov functions, convex analysis, methods of homogeneous random walks, and complex analysis arguments.", "target": "", "edits": [], "_id": 2311.06652}, {"context": "On the number of subdirect products involving semigroups of integers and\n  natural numbers", "source": "We extend a recent result that for the (additive) semigroup of positive integers $\\mathbb{N}$, there are continuum many subdirect products of $\\mathbb{N} \\times \\mathbb{N}$ up to isomorphism. We prove that for $U,V$ each one of $\\mathbb{Z}$ (the group of integers), $\\mathbb{N}_{0}$ (the monoid of non-negative integers), or $\\mathbb{N}$, we prove that $U \\times V$ has continuum many (semigroup) subdirect products up to isomorphism.", "target": "", "edits": [], "_id": 2311.04994}, {"context": "De Finetti's Control Problem with Poisson Observations under Spectrally\n  Positive Markov Additive Process", "source": "We study a De Finetti's optimal dividend and capital injection problem under a Markov additive model. The surplus process before dividend and capital injection is assumed to follow a spectrally positive Markov additive process (MAP). Dividend payments are made only at the jump times of an independent Poisson process and capitals are injected to avoid bankruptcy. The aim of the paper is to characterize an optimal periodic dividend and capital injection strategy that maximizes the expected total discounted dividends subtracted by the total discounted costs of capital injection. Applying the fluctuation and excursion theory for Levy processes and the stochastic control theory, we first address an auxiliary periodic dividend and capital injection control problem with a terminal payoff under the spectrally positive Levy process. Using results obtained for this auxiliary problem and a fixed point argument for iterations induced by dynamic program, we characterize the optimal strategy of our prime control problem as a regime-modulated double-barrier periodic-continuous-reflection dividend and capital injection strategy.", "target": "", "edits": [], "_id": 2311.04555}, {"context": "Approximation by polynomials with constant coefficients and the\n  Thresholding Greedy Algorithm", "source": "Greedy bases are those bases where the Thresholding Greedy Algorithm (introduced by S. V. Konyagin and V. N. Temlyakov) produces the best possible approximation up to a constant. In 2017, Bern\\'a and Blasco gave a characterization of these bases using polynomials with constant coefficients. In this paper, we continue this study improving some optimization problems and extending some results to the context of quasi-Banach spaces.", "target": "", "edits": [], "_id": 2309.14607}, {"context": "Equivariant algebraic concordance of strongly invertible knots", "source": "By considering a particular type of invariant Seifert surfaces we define a homomorphism $\\Phi$ from the equivariant concordance group of directed strongly invertible knots $\\widetilde{\\mathcal{C}}$ to a new equivariant algebraic concordance group $\\widetilde{\\mathcal{G}}^{\\mathbb{Z}}$. We prove that $\\Phi$ lifts both Miller and Powell's equivariant algebraic concordance homomorphism and Alfieri and Boyle's equivariant signature. Moreover, we provide a partial result on the isomorphism type of $\\widetilde{\\mathcal{G}}^{\\mathbb{Z}}$ and we obtain a new obstruction to equivariant sliceness, which can be viewed as an equivariant Fox-Milnor condition. We define new equivariant signatures and using these we obtain novel lower bounds on the equivariant slice genus. Finally, we show that $\\Phi$ is invariant under topological equivariant concordance and that can obstruct equivariant sliceness for knots with Alexander polynomial one.", "target": "", "edits": [], "_id": 2303.11895}, {"context": "On uniformly quasiconformal Anosov diffeomorphisms with two dimensional\n  distributions", "source": "We prove that a transitive uniformly $u$-quasiconformal Anosov diffeomorphism with a two-dimensional unstable distribution has a globally defined stable holonomy. As a corollary, we are able to remove an additional assumption in a theorem of Kalinin-Sadovskaya, and deduce that all transitive uniformly quasiconformal Anosov diffeomorphisms are $C^{\\infty}$-conjugate to affine Anosov diffeomorphisms on infra-torus.", "target": "", "edits": [], "_id": 2311.00251}, {"context": "On the Crazy Knight's Tour Problem", "source": "Heffter arrays are partially filled arrays that have been introduced in [1] as a tool to construct regular embeddings of graphs on surfaces. These constructions can be achieved from the solution of a tour problem on the filled cells of the array, introduced in [3] and called Crazy Knight's Tour Problem. In particular, the knight's move is seen as the composition of an horizontal move and a vertical one, where the directions (leftward or rightward, upward or downward respectively) are prescribed in advance for each row and each column of the array and each filled cell is mapped to the first filled cell encountered along that direction. Then, a solution to the Crazy Knight's Tour Problem is a set of directions such that the resulting move function is a tour over the array. Here, we consider a particular class of square arrays, and we construct solutions to the tour problem in some infinite families of these arrays.", "target": "", "edits": [], "_id": 2311.09054}, {"context": "Baire Measurable Matchings in Non-Amenable Graphs", "source": "We prove that every Schreier graph of a free Borel action of a finitely generated non-amenable group has a Baire measurable perfect matching. This result was previously only known in the bipartite setting. We also prove that every Borel non-amenable bounded degree graph with only even degrees has a Baire measurable balanced orientation.", "target": "", "edits": [], "_id": 2310.20047}, {"context": "The matroid of a graphing", "source": "Graphings serve as limit objects for bounded-degree graphs. We define the ``cycle matroid'' of a graphing as a submodular setfunction, with values in [0,1], which generalizes (up to normalization) the cycle matroid of finite graphs. We prove that for a Benjamini--Schramm convergent sequence of graphs, the total rank, normalized by the number of nodes, converges to the total rank of the limit graphing.", "target": "", "edits": [], "_id": 2311.03868}, {"context": "Fuglede-type arguments for isoperimetric problems and applications to\n  stability among convex shapes", "source": "This paper is concerned with stability of the ball for a class of isoperimetric problems under convexity constraint. Considering the problem of minimizing $P+\\varepsilon R$ among convex subsets of $\\mathbb{R}^N$ of fixed volume, where $P$ is the perimeter functional, $R$ is a perturbative term and $\\varepsilon>0$ is a small parameter, stability of the ball for this perturbed isoperimetric problem means that the ball is the unique (local, up to translation) minimizer for any $\\varepsilon$ sufficiently small. We investigate independently two specific cases where $\\Omega\\mapsto R(\\Omega)$ is an energy arising from PDE theory, namely the capacity and the first Dirichlet eigenvalue of a domain $\\Omega\\subset\\mathbb{R}^N$. While in both cases stability fails among all shapes, in the first case we prove (non-sharp) stability of the ball among convex shapes, by building an appropriate competitor for the capacity of a perturbation of the ball. In the second case we prove sharp stability of the ball among convex shapes by providing the optimal range of $\\varepsilon$ such that stability holds, relying on the \\emph{selection principle} technique and a regularity theory under convexity constraint.", "target": "", "edits": [], "_id": 2304.12157}, {"context": "Stochastic wave equation with H\\\"older noise coefficient: well-posedness\n  and small mass limit", "source": "We construct unique martingale solutions to the damped stochastic wave equation $$ \\mu \\frac{\\partial^2u}{\\partial t^2}(t,x)=\\Delta u(t,x)-\\frac{\\partial u}{\\partial t}(t,x)+b(t,x,u(t,x))+\\sigma(t,x,u(t,x))\\frac{dW_t}{dt},$$   where $\\Delta$ is the Laplacian on $[0,1]$ with Dirichlet boundary condition, $W$ is space-time white noise, $\\sigma$ is $\\frac{3}{4}+\\epsilon$ -H\\\"older continuous in $u$ and uniformly non-degenerate, and $b$ has linear growth. The same construction holds for the stochastic wave equation without damping term. More generally, the construction holds for SPDEs defined on separable Hilbert spaces with a densely defined operator $A$, and the assumed H\\\"older regularity on the noise coefficient depends on the eigenvalues of $A$ in a quantitative way. We further show the validity of the Smoluchowski-Kramers approximation: assume $b$ is H\\\"older continuous in $u$, then as $\\mu$ tends to $0$ the solution to the damped stochastic wave equation converges in distribution, on the space of continuous paths, to the solution of the corresponding stochastic heat equation. The latter result is new even in the case of additive noise.", "target": "", "edits": [], "_id": 2305.04068}, {"context": "An alternate proof of Payan's theorem on cubelike graphs", "source": "A cubelike graph is a Cayley graph on the product $\\mathbb{Z}_2\\times\\cdots\\times\\mathbb{Z}_2$ of the integers modulo $2$ with itself finitely many times. In 1992, Payan proved that no cubelike graph can have chromatic number $3$. The authors of the present paper previously developed a general matrix method for studying chromatic numbers of Cayley graphs on abelian groups. In this note, we apply this method of Heuberger matrices to give an alternate proof of Payan's theorem.", "target": "", "edits": [], "_id": 2303.06267}, {"context": "Moments of polynomial functionals in Levy-driven queues with secondary\n  jumps", "source": "A long-standing open problem concerns the calculation of the moments of the area beneath the M/G/1 workload graph during a busy period. While expressions for the first two moments were known, no results for higher moments were available. This paper includes a recursive algorithm to compute all moments in terms of the model primitives. Our results extend to any storage system fed by a superposition of a drifted Brownian motion and a subordinator with a secondary jump input, yielding the moments of a general class of polynomial functionals of the workload process. Some applications of these moments are also provided.", "target": "", "edits": [], "_id": 2310.11137}, {"context": "A General Theory for Exact Sparse Representation Recovery in Convex\n  Optimization", "source": "In this paper, we investigate the recovery of the sparse representation of data in general infinite-dimensional optimization problems regularized by convex functionals. We show that it is possible to define a suitable non-degeneracy condition on the minimal-norm dual certificate, extending the well-established non-degeneracy source condition (NDSC) associated with total variation regularized problems in the space of measures, as introduced in (Duval and Peyr\\'e, FoCM, 15:1315-1355, 2015). In our general setting, we need to study how the dual certificate is acting, through the duality product, on the set of extreme points of the ball of the regularizer, seen as a metric space. This justifies the name Metric Non-Degenerate Source Condition (MNDSC). More precisely, we impose a second-order condition on the dual certificate, evaluated on curves with values in small neighbourhoods of a given collection of n extreme points. By assuming the validity of the MNDSC, together with the linear independence of the measurements on these extreme points, we establish that, for a suitable choice of regularization parameters and noise levels, the minimizer of the minimization problem is unique and is uniquely represented as a linear combination of n extreme points. The paper concludes by obtaining explicit formulations of the MNDSC for three problems of interest. First, we examine total variation regularized deconvolution problems, showing that the classical NDSC implies our MNDSC, and recovering a result similar to (Duval and Peyr\\'e, FoCM, 15:1315-1355, 2015). Then, we consider 1-dimensional BV functions regularized with their BV-seminorm and pairs of measures regularized with their mutual 1-Wasserstein distance. In each case, we provide explicit versions of the MNDSC and formulate specific sparse representation recovery results.", "target": "", "edits": [], "_id": 2311.08072}, {"context": "Mass independent shapes for relative equilibria in the two dimensional\n  positive curved three body problem", "source": "In the planar three-body problem under Newtonian potential, it is well known that any masses, located at the vertices of an equilateral triangle generates a relative equilibrium, known as the Lagrange relative equilibrium. In fact, the equilateral triangle is the unique mass independent shape for a relative equilibrium in this problem.   The two dimensional positive curved three-body problem, is a natural extension of the Newtonian three-body problem to the sphere $\\mathbb{S}^2$, where the masses are moving under the influence of the cotangent potential. S.~Zhu showed that in this problem, equilateral triangle on a rotating meridian can form a relative equilibria for any masses. This was the first report of mass independent shape on $\\mathbb{S}^2$ which can form a relative equilibrium. %   In this paper, we show that, in addition to the equilateral triangle, three isosceles triangles on a rotating meridian, with $\\theta_{ij}=\\theta_{jk}=2^{-1}\\arccos((\\sqrt{2}-1)/2)$ for $(i,j,k)=(1,2,3)$, $(2,3,1)$, $(3,1,2)$ always form relative equilibria for any choice of the masses; where $\\theta_{ij}$ are the angles between the two masses $i$ and $j$ seen from the centre of $\\mathbb{S}^2$. Additionally we prove that, the equilateral and the above three isosceles relative equilibria are unique with this characteristic. We also prove that each relative equilibrium generated by a mass independent shape is not isolated from the other relative equilibria.", "target": "", "edits": [], "_id": 2311.0277}, {"context": "Topological and control theoretic properties of Hamilton-Jacobi\n  equations via Lax-Oleinik commutators", "source": "In the context of weak KAM theory, we discuss the commutators $\\{T^-_t\\circ T^+_t\\}_{t\\geqslant0}$ and $\\{T^+_t\\circ T^-_t\\}_{t\\geqslant0}$ of Lax-Oleinik operators. We characterize the relation $T^-_t\\circ T^+_t=Id$ for both small time and arbitrary time $t$. We show this relation characterizes controllability for evolutionary Hamilton-Jacobi equation. Based on our previous work on the cut locus of viscosity solution, we refine our analysis of the cut time function $\\tau$ in terms of commutators $T^+_t\\circ T^-_t-T^+_t\\circ T^-_t$ and clarify the structure of the super/sub-level set of the cut time function $\\tau$.", "target": "", "edits": [], "_id": 2311.07}, {"context": "Torsion and twists of abelian varieties", "source": "In this article, we investigate the possible torsion subgroups of twists of abelian varieties with good reduction. As an application, we prove a theorem concerning ramified primes over any quadratic extension where odd-order torsion growth is achieved. In particular, we show that for every rational elliptic curve and every imaginary quadratic field not equal to $\\mathbb{Q}(\\sqrt{-3})$ satisfying the Heegner hypothesis no odd-order torsion growth can occur.", "target": "", "edits": [], "_id": 2310.11086}, {"context": "The Distribution of Sandpile Groups of Random Graphs with their Pairings", "source": "We determine the distribution of the sandpile group (also known as the Jacobian) of the Erd\\H{o}s-R\\'{e}nyi random graph $G(n,q)$ along with its canonical duality pairing as $n$ tends to infinity, fully resolving a conjecture from 2015 due to Clancy, Leake, and Payne and generalizing the result by Wood on the groups. In particular, we show that a finite abelian $p$-group $G$ equipped with a perfect symmetric pairing $\\delta$ appears as the Sylow $p$-part of the sandpile group and its pairing with frequency inversely proportional to $|G||\\mathrm{Aut}(G,\\delta)|$, where $\\mathrm{Aut}(G,\\delta)$ is the set of automorphisms of $G$ preserving the pairing $\\delta$. While this distribution is related to the Cohen-Lenstra distribution, the two distributions are not the same on account of the additional algebraic data of the pairing. The proof utilizes the moment method: we first compute a complete set of moments for our random variable (the average number of epimorphisms from our random object to a fixed object in the category of interest) and then show the moments determine the distribution. To obtain the moments, we prove a universality result for the moments of cokernels of random symmetric integral matrices whose dual groups are equipped with symmetric pairings that is strong enough to handle both the dependence in the diagonal entries and the additional data of the pairing. We then apply results due to Sawin and Wood to show that these moments determine a unique distribution.", "target": "", "edits": [], "_id": 2311.07078}, {"context": "Irreducibility of some crystalline loci with irregular Hodge--Tate\n  weights", "source": "We show that loci of crystalline representations of $G_K$ for $K/\\mathbb{Q}_p$ an unramified extension are irreducible when the Hodge--Tate weights are fixed and sufficiently small. This was previously known for weights in the interval $[-p,0]$ and in this paper we show how that this bound can be relaxed provided the Hodge--Tate weights are sufficiently irregular at certain embeddings. This is motivated by the desire to extend the conjectures of Breuil--M\\'ezard on loci of potentially crystalline representations to irregular weights.", "target": "", "edits": [], "_id": 2311.11989}, {"context": "Diameter of K\\\"ahler currents", "source": "We establish upper bounds on the diameter of compact K\\\"ahler manifolds endowed with K\\\"ahler metrics whose volume form satisfies an Orlicz integrability condition. Our results extend previous estimates due to Fu-Guo-Song, Y.Li, and Guo-Phong-Song-Sturm. In particular, they do not involve any constraint on the vanishing of the volume form. Moreover, we show that singular K\\\"ahler-Einstein currents have finite diameter, provided that their local potentials are H\\\"older continuous.", "target": "", "edits": [], "_id": 2310.20482}, {"_thresh_template": "# As fine-grained annotation requires complex categories, many successful fine-grained \n# typologies organize their classification in trees. Our interface is unique in that it can \n# render any arbitrary annotation tree, no matter its depth or breath. We will begin with \n# simple annotation setups, and then showcase some complex examples.\n\n# Click the Instructions button to view this :)\n\ninstructions: |\n  ## Adding instructions to your interface\n  Instructions are formatted with [Markdown](https://www.markdownguide.org/cheat-sheet/). \n  You can use the `prepend_instructions` argument to display this text above the interface, or have an \"Instructions\" button.\n\n  ### Formatting\n  Markdown allows creating **bold** or *italicized* text and:\n  - lists\n  - of\n  - items\n\n  ```\n  You can even add blocks of code\n  ```\n  ---\n\n# Comment this to package the instructions using an \"Instructions\" button\n# prepend_instructions: true\n\n# ========================================================================================\n# ========================================================================================\n\n\nedits:\n  # You can specify any number of individual questions\n  - name: multi_question\n    label: \"Annotate Term\"\n    enable_input: true\n    color: blue\n    icon: fa-pen\n    type: single_span\n    annotation:\n      - name: defn_question\n        label: \"Definition\"\n        question: \"Write a one-sentence definition of this term. If you wish to use Google, please use the following search format `define:\\\"<term>\\\"`, substituting your identified term for `<term>` (make sure to include the quotation marks).\"\n        options: textarea\n      - name: difficulty_question\n        label: \"Difficulty\"\n        question: \"How difficult is defining this term?\"\n        options: likert-3\n      - name: category_question\n        label: \"Category\"\n        question: \"Which category would you this term to?\"\n        options: \n          - name: a1\n            label: \"Concept/phrase\"\n          - name: a2\n            label: \"Abbreviation\"\n          - name: a3\n            label: \"Named Entity\"\n          # - name: child_4\n          #   label: \"Other\"\n      - name: multisense_question\n        label: \"Multisense\"\n        question: \"Does this term have different meanings in other domain contexts? If you're uncertain, choose 'Unsure'.\"\n        options: \n          - name: b1\n            label: \"Yes\"\n          - name: b2\n            label: \"No\"\n          - name: b3\n            label: \"Unsure\"\n\n\n\n# ========================================================================================\n# ========================================================================================\n\ntemplate_name: llm_dfs\ntemplate_label: Scientific Concept Identification & Definition\ntemplate_description: TODO\n\n\ndisplay:\n - side-by-side         # shows text and editor next to each other\n#  - text-side-by-side    # shows source and target next to each other\n#  - disable-lines        # disables lines between annotations which can be distracting\n#  - hide-context         # hides the context by default, adding a \"show context\" button\n\ndisable:\n- download        # Disables data download, useful for crowdsourcing\n# - upload          # Disables data upload, useful if data is provided with ?d= parameter\n# - selection     # Disables edit selection\n# - annotation      # Disables edit annotation"}]