[{"context": "Optimizing Surgical Wound Care in Obstetrics and Gynecology.", "source": "Obstetrics and gynecology (OB/GYN) accounts for at least half of all open abdominal surgeries performed. Rates of surgical wound complications after open procedures in OB/GYN range from 5% to 35%. Therefore, optimizing management of surgical wound complications has the potential to significantly reduce cost and morbidity. However, guidelines addressing best practices for wound care in OB/GYN are limited.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_14598"}, {"context": "Age-Related Changes in Inter-Joint Interactions for Global and Local Kinematics While Standing.", "source": "Inter-joint interactions are involved in human standing. These interactions work not only for global kinematics that control the center of mass (COM) of the entire body, but also for local kinematics that control joint angular movements. Age-related changes in these interactions are thought to cause unstable standing postures in older people. Interactions of global kinematics are known to be deficient owing to aging. However, it is unclear whether the interaction of local kinematics is affected by aging. We investigated the age-related changes in inter-joint interactions, especially local kinematics, during standing. Differences were investigated in these two inter-joint interactions between older and younger adults in three different postures: normal, eyes-closed, and foam-surface standings. The inter-joint interaction for local kinematics was computed using the induced-acceleration analysis with a double-inverted pendulum model and quantified using an uncontrolled manifold approach. Consistent with previous studies, the inter-joint interaction for COM acceleration (global kinematics) deteriorated in older adults. In contrast, the interactions for angular accelerations in the ankle and hip joints (local kinematics) were slightly better in the older adults. Moreover, the individual components of angular acceleration which were induced by net torques from homonymous and remote joints were significantly increased in older adults. Thus, global and local inter-joint interactions are driven by distinct neural mechanisms and the interaction of local kinematics can compensate for the increment of each component of joint angular acceleration in older adults.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_604"}, {"context": "Minocycline in depression not responding to first-line therapy: A systematic review and meta-analysis.", "source": "Major depressive disorder is often resistant to first-line treatment, with around 30% failing to respond to traditional therapy. Treatment-resistant depression results in prolonged hospitalization and healthcare costs. Anti-inflammatory drugs have shown promising results in depression not responding to initial therapy. Minocycline has anti-inflammatory properties and crosses the blood-brain barrier. It has demonstrated varied results in several randomized controlled trials (RCTs).", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_9944"}, {"context": "Novel <i>N</i>-Arylmethyl-aniline/chalcone hybrids as potential VEGFR inhibitors: synthesis, biological evaluations, and molecular dynamic simulations.", "source": "Significant advancements have been made in the domain of targeted anticancer therapy for the management of malignancies in recent times. VEGFR-2 is characterised by its pivotal involvement in angiogenesis and subsequent mechanisms that promote tumour cells survival. Herein, novel &lt;i&gt;N&lt;/i&gt;-arylmethyl-aniline/chalcone hybrids &lt;b&gt;5a-5n&lt;/b&gt; were designed and synthesised as potential anticancer and VEGFR-2 inhibitors. The anticancer activity was evaluated at the NCI-USA, resulting in the identification of 10 remarkably potent molecules &lt;b&gt;5a-5j&lt;/b&gt; that were further subjected to the five-dose assays. Thereafter, they were explored for their VEGFR-2 inhibitory activity where &lt;b&gt;5e&lt;/b&gt; and &lt;b&gt;5h&lt;/b&gt; emerged as the most potent inhibitors. &lt;b&gt;5e&lt;/b&gt; and &lt;b&gt;5h&lt;/b&gt; induced apoptosis with cell cycle arrest at the SubG&lt;sub&gt;0&lt;/sub&gt;-G&lt;sub&gt;1&lt;/sub&gt; phase within HCT-116 cells. Moreover, their impact on some key apoptotic genes was assessed, suggesting caspase-dependent apoptosis. Furthermore, molecular docking and molecular dynamics simulations were conducted to explore the binding modes and stability of the protein-ligand complexes.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_15544"}, {"context": "A strong quick-release biointerface in mussels mediated by serotonergic cilia-based adhesion.", "source": "The mussel byssus stem provides a strong and compact mechanically mismatched biointerface between living tissue and a nonliving biopolymer. Yet, in a poorly understood process, mussels can simply jettison their entire byssus, rebuilding a new one in just hours. We characterized the structure and composition of the byssus biointerface using histology, confocal Raman mapping, phase contrast-enhanced microcomputed tomography, and advanced electron microscopy, revealing a sophisticated junction consisting of abiotic biopolymer sheets interdigitated between living extracellular matrix. The sheet surfaces are in intimate adhesive contact with billions of motile epithelial cilia that control biointerface strength and stem release through their collective movement, which is regulated neurochemically. We posit that this may involve a complex sensory pathway by which sessile mussels respond to environmental stresses to release and relocate.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_13651"}, {"context": " <i>In vitro</i> evaluation of cytotoxic potential of essential oil extracted from leaves of <i>Croton heliotropiifolius</i> Kunth in human tumor cells.", "source": "&lt;i&gt;Croton heliotropiifolius&lt;/i&gt; Kunth, popularly known as &quot;velame,&quot; is a shrub that resides in northeastern Brazil. The essential oil of &lt;i&gt;C. heliotropiifolius&lt;/i&gt; contains high concentrations of volatile compounds in the leaves and is widely used in folk medicine for many purposes as an antiseptic, analgesic, sedative, and anti-inflammatory agent. Due to the apparent limited amount of information, the aim of this study was to determine the cytotoxic potential of essential oil extracted from leaves of &lt;i&gt;C. heliotropiifolius&lt;/i&gt;, utilizing different human cancer cell lines (HL-60, leukemia; HCT-116, colon; MDA-MB435, melanoma; SF295, glioblastoma) and comparison to murine fibroblast L929 cell line. The chemical characterization of the essential oil revealed the presence of large amounts of monoterpenes and sesquiterpenes, the majority of which were aristolene (22.43%), germacrene D (11.38%), &amp;#611;-terpinene (10.85%), and limonene (10.21%). The essential oil exerted significant cytotoxicity on all cancer cells, with low activity on murine L929 fibroblasts, independent of disruption of cell membranes evidenced by absence of hemolytic activity. The cytotoxicity identified was associated with oxidative stress, which culminated in mitochondrial respiration dysfunction and direct or indirect DNA damage (strand breaks and oxidative damage), triggering cell death via apoptosis. Our findings suggest that extracts of essential oil of &lt;i&gt;C. Heliotropiifolius&lt;/i&gt; may be considered as agents to be used therapeutically in treatment of certain cancers.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_3326"}, {"context": "A Case of Stress Cardiomyopathy With Nab-Paclitaxel Infusion.", "source": "Stress cardiomyopathy is a transient left ventricular dysfunction caused by physiologic or pathologic stressors. Anaphylaxis is a hypersensitivity disorder that can lead to a rapid life-threatening respiratory collapse. It happens due to exposure to allergens including medications. During anaphylaxis, there is a compensatory release of catecholamines that can lead to stress cardiomyopathy. In this case, nab-paclitaxel infusion led to anaphylaxis with respiratory failure. Echocardiogram showed features of diffuse hypokinesis with preserved basal segment contractility, and cardiac catheterization did not show any evidence of obstructive coronary artery disease. The overall clinical picture suggested stress cardiomyopathy. The patient was treated with guideline-directed medical therapy which resulted in normalization of the ejection fraction with no symptoms of congestive heart failure at any point. The patient was thereafter resumed on a reduced dose of nab-paclitaxel. This case report adds to the spectrum of infusion-related reactions associated with paclitaxel and demonstrates the course of events in the management of anaphylaxis and stress cardiomyopathy in this scenario.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_2129"}, {"context": "Tricuspid Valve Transcatheter Edge-To-Edge Repair Guidance with Transesophageal Echocardiography and Intracardiac Echocardiography.", "source": "As transcatheter tricuspid interventions have emerged, especially edge-to-edge repair, imaging has shown to be key in optimizing transcatheter outcomes. Given the location of the tricuspid valve relative to the esophagus, transesophageal echocardiography has proven difficult and utilization of three-dimensional (3D) multiplanar reconstruction has become essential. Three-dimensional intracardiac echocardiography is a useful imaging adjunct for tricuspid edge-to-edge repair. As 3D intracardiac echocardiography evolves, it may supplant transesophageal echocardiography as the imaging modality of choice in transcatheter tricuspid valve interventions.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_15101"}, {"context": "Promiscuous Yet Specific: A Methionine-Aromatic Interaction Drives the Reaction Scope of the Family 1 Glycosyltransferase <i>Gm</i>UGT88E3 from Soybean.", "source": "Family 1 glycosyltransferases (GT1s, UGTs) catalyze the regioselective glycosylation of natural products in a single step. We identified &lt;i&gt;Gm&lt;/i&gt;UGT88E3 as a particularly promising biocatalyst able to produce a variety of pure, single glycosidic products from polyphenols with high chemical yields. We investigated this particularly desirable duality toward specificity, i.e., promiscuous toward acceptors while regiospecific. Using high-field NMR, kinetic characterization, molecular dynamics simulations, and mutagenesis studies, we uncovered that the main molecular determinant of &lt;i&gt;Gm&lt;/i&gt;UGT88E3 specificity is a methionine-aromatic bridge, an interaction often present in protein structures but never reported for enzyme-substrate interactions. Here, mutating Met127 led to inactive proteins or 100-fold reduced activity.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_20702"}, {"context": "The Neurobiology of Trauma: Developing a Decision Aid for the Care of Persons After Sexual Assault.", "source": "The care of the person who has been sexually assaulted is challenging because of the neurobiology of trauma, susceptibility to re-victimization, and time constraints. Everyone involved with their care needs to be cognizant of the psychological-physiological phenomena of trauma in order to provide sensitive, high-quality care to these individuals. The neurobiology of trauma explains why the person&#x27;s memory may be fragmented or impaired. Trauma-informed care offers choices and empowerment to the person along with safety, cultural awareness, trust, and collaboration. Shared decision making empowers the person by educating them on their care choices in collaboration with the health-care provider. This article discusses the development of a decision aid that supports the information used in shared decision making, for use in planning the care for a person who has been sexually assaulted. Based on the understanding of the neurobiology of trauma, the decision aid incorporates a written tool that provides education and information to prepare the person to make care/treatment decisions which are important to them, within a trauma-informed environment.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_2349"}]