[{"context": "Status Dystonicus in Subacute Sclerosing Panencephalitis-A Rare Presentation in Emergency.", "source": "Dystonia has been described in a few cases with SSPE, but there are only very few reports with status dystonicus and none from South India. Here, we report a six-year-old child presenting with severe dystonic posturing of all four limbs and trunk for 10 days duration following a febrile illness and initially treated elsewhere as viral encephalitis. Scalp EEG showed periodic high-amplitude slow wave discharges. MRI brain showed T2/FLAIR hyperintensity in bilateral frontal, left parietal, and deep white matter, extending across the corpus collosum with diffuse cerebral atrophy. The titer for IgG antibodies to measles virus by ELISA was 1:625, suggestive of SSPE. With medications, dystonia used to subside transiently; however, the patient had worsening of symptoms and showed gradual deterioration.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_3595"}, {"context": "Quantification of Thiopurine Metabolites in Human Erythrocytes by Liquid Chromatography-Tandem Mass Spectrometry (LC-MS/MS).", "source": "The thiopurine drugs, azathioprine, mercaptopurine, and thioguanine, are widely used in the treatment of several malignant and nonmalignant diseases. These inactive prodrugs undergo extensive metabolism to form active cytotoxic metabolites, which act mainly by incorporating into DNA and affecting cell replication. Thiopurine methyltransferase is a highly variable cytosolic enzyme that catalyzes the S-methylation of the thiopurine bases-an inactivating pathway. Patients with low-activity variants of TPMT can be affected by pronounced pharmacologic effects when receiving thiopurine medications. Clinical studies have reported significant interpatient variability in intracellular thiopurine metabolite concentrations in patients receiving thiopurine therapy. In this chapter, we present an LC-MS/MS method to monitor the thiopurine metabolites: 6-thioguanine nucleotides and 6-methylmercaptopurine derivatives in human erythrocytes. This method utilizes acid hydrolysis to release the bases and improves upon previously published procedures by utilizing stable isotope internal standards and a more efficient chromatographic separation.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_25974"}, {"context": "Isothermal Titration Calorimetry to Study Plant Peptide Ligand-Receptor Interactions.", "source": "The field of plant receptor biology has rapidly expanded in the past three decades. However, the demonstration of direct interaction between receptor-ligand pairs remains a challenge. Identifying and quantifying protein-ligand interactions is crucial for understanding how they regulate certain physiological processes. An important aspect is the quantification of different parameters of the interaction, like binding affinity, kinetics, and ligand specificity that drive the formation of signaling complexes. In this chapter, we discuss Isothermal Titration Calorimetry (ITC) as a label-free technique to measure thermodynamic parameters of ligand binding with high accuracy and reproducibility. We provide a detailed guideline how to design, perform, analyze, and interpret ITC measurements using as an example the interaction between the SCHENGEN3/GASSHO1 (SGN3/GSO1) leucine-rich repeat receptor-like kinase and its sulfated peptide ligand CASPARIAN STRIP INTEGRITY FACTOR 2 (CIF2).", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_23868"}, {"context": "Quantifying Substrate Protein Secretion via the Type III Secretion System of the Bacterial Flagellum.", "source": "Protein transport across the cytoplasmic membrane is coupled to energy derived from ATP hydrolysis or the proton motive force. A sophisticated, multi-component type III secretion system (T3SS) exports substrate proteins of both the bacterial flagellum and virulence-associated injectisome system of many Gram-negative pathogens. The T3SS is primarily a proton motive force-driven protein exporter. Here, we describe a method to investigate the export of substrate proteins of the flagellar T3SS into the culture supernatant under conditions that manipulate the proton motive force. Further, we describe methods to precisely quantify flagellar protein export into the culture supernatant using a split NanoLuc luciferase, and how fluorescence labeling of the extracellular flagellar filament can bring insights into the protein export rate of individual flagellar T3SS.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_4015"}, {"context": "Glucose trend prediction model based on improved wavelet transform and gated recurrent unit.", "source": "Glucose trend prediction based on continuous glucose monitoring (CGM) data is a crucial step in the implementation of an artificial pancreas (AP). A glucose trend prediction model with high accuracy in real-time can greatly improve the glycemic control effect of the artificial pancreas and effectively prevent the occurrence of hyperglycemia and hypoglycemia. In this paper, we propose an improved wavelet transform threshold denoising algorithm for the non-linearity and non-smoothness of the original CGM data. By quantitatively comparing the mean square error (MSE) and signal-to-noise ratio (SNR) before and after the improvement, we prove that the improved wavelet transform threshold denoising algorithm can reduce the degree of distortion after the smoothing of CGM data and improve the extraction effect of CGM data features at the same time. Based on this finding, we propose a glucose trend prediction model (IWT-GRU) based on the improved wavelet transform threshold denoising algorithm and gated recurrent unit. We compared the root mean square error (RMSE), mean absolute percentage error (MAPE), and coefficient of determination ($ {\\mathrm{R}}^{2} $) of Recurrent Neural Networks (RNN), Long Short-Term Memory (LSTM), Support vector regression (SVR), Gated Recurrent Unit (GRU) and IWT-GRU on the original CGM monitoring data of 80 patients for 7 consecutive days with different prediction horizon (PH). The results showed that the IWT-GRU model outperformed the other four models. At PH = 45 min, the RMSE was 0.5537 mmol/L, MAPE was 2.2147%, $ {\\mathrm{R}}^{2} $ was 0.989 and the average runtime was only 37.2 seconds. Finally, we analyze the limitations of this study and provide an outlook on the future direction of blood glucose trend prediction.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_2226"}, {"context": "The anti-inflammatory and vasoprotective properties of mPGES-1 inhibition offer promising therapeutic potential.", "source": "Label=\"INTRODUCTION\" NlmCategory=\"UNASSIGNED\">Prostaglandin E<sub>2</sub> (PGE<sub>2</sub>) is produced by cyclooxygenases (COX-1/2) and the microsomal prostaglandin E synthase 1 (mPGES-1). PGE<sub>2</sub> is pro-inflammatory in diseases such as rheumatoid arthritis, cardiovascular disorders, and cancer. While Nonsteroidal anti-inflammatory drugs (NSAIDs) targeting COX can effectively reduce inflammation, their use is limited by gastrointestinal and cardiovascular side effects resulting from the blockade of all prostanoids. To overcome this limitation, selective inhibition of mPGES-1 is being explored as an alternative therapeutic strategy to inhibit PGE<sub>2</sub> production while sparing or even upregulating other prostaglandins. However, the exact timing and location of PGH<sub>2</sub> conversion to PGD<sub>2</sub>, PGI<sub>2</sub>, TXB<sub>2</sub> or PGF<sub>2&#945;</sub>, and whether it hinders or supports the therapeutic effect of mPGES-1 inhibition, is not fully understood.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_22454"}, {"context": "Outcomes of Pharmacist-Led Treatment of Hepatitis C in the Virginia Department of Corrections.", "source": "A higher proportion of people in correctional settings have, or are at risk for, hepatitis C virus (HCV) due to socioeconomic factors, mental health concerns, substance use disorders, history of high-risk experiences, and more. Compared with the general population, the prevalence of HCV is 10 times higher among people who are incarcerated. The objective of this retrospective cohort study was to describe the HCV treatment cascade in a pharmacist-led clinic model, from referral through treatment completion and documentation of cure. Pharmacists in the Virginia Department of Corrections, in collaboration with Virginia Commonwealth University, established and led a telemedicine HCV clinic. A total of 1,040 incarcerated individuals with chronic HCV infection were treated between January 2020 and January 2022. In this study, the clinical endpoint was the number of patients achieving a 12-week sustained virological response (SVR12), which is considered cure of an HCV infection. The economic endpoint was total dollars spent per patient to achieve the SVR12. Participants were HCV treatment naïve, positive for HCV genotypes 1-6, not concurrently infected with HIV, and without decompensated liver disease. The overall cure rate was 97% with no discontinuation due to adverse effects. The cost-to-cure ratio was $23,223/person achieving SVR12.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_7189"}, {"context": "Survival in Incident Cases with Frontotemporal Lobar Degeneration: A Registry-Based Study.", "source": "Population-based registries represent a unique sample to estimate survival. The aim of the present study was to assess survival rates and predictors of outcome in incidental frontotemporal lobar degeneration (FTLD). Incident cases with FTLD, included between January 1, 2017 to December 31, 2017, have been followed for five years. Median survival was 8.16 years from disease onset and 5.38 years from diagnosis. Survival rates did not differ between phenotypes. Shorter disease duration from onset to diagnosis was associated with poorer outcome (p = 0.01). FTLD is a relatively homogeneous disease in terms of survival. Future multinational population-based studies are needed to confirm these findings.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_3348"}, {"context": "Pesticides and the Microbiome-Gut-Brain Axis: Convergent Pathways in the Pathogenesis of Parkinson's Disease.", "source": "The increasing global burden of Parkinson's disease (PD), termed the PD pandemic, is exceeding expectations related purely to population aging and is likely driven in part by lifestyle changes and environmental factors. Pesticides are well recognized risk factors for PD, supported by both epidemiological and experimental evidence, with multiple detrimental effects beyond dopaminergic neuron damage alone. The microbiome-gut-brain axis has gained much attention in recent years and is considered to be a significant contributor and driver of PD pathogenesis. In this narrative review, we first focus on how both pesticides and the microbiome may influence PD initiation and progression independently, describing pesticide-related central and peripheral neurotoxicity and microbiome-related local and systemic effects due to dysbiosis and microbial metabolites. We then depict the bidirectional interplay between pesticides and the microbiome in the context of PD, synthesizing current knowledge about pesticide-induced dysbiosis, microbiome-mediated alterations in pesticide availability, metabolism and toxicity, and complex systemic pesticide-microbiome-host interactions related to inflammatory and metabolic pathways, insulin resistance and other mechanisms. An overview of the unknowns follows, and the role of pesticide-microbiome interactions in the proposed body-/brain-first phenotypes of PD, the complexity of environmental exposures and gene-environment interactions is discussed. The final part deals with possible further steps for translation, consisting of recommendations on future pesticide use and research as well as an outline of promising preventive/therapeutic approaches targeted on strengthening or restoring a healthy gut microbiome, closing with a summary of current gaps and future perspectives in the field.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_3366"}, {"context": "Unveiling the Halogenation-Induced Formation of Hg<sub>3</sub>Se<sub>2</sub>X<sub>2</sub> (X = Cl, Br, and I) Compounds for Multiphase Mercury Cycling.", "source": "The interaction between mercury (Hg) and inorganic compounds, including selenium (Se), sulfur (S), and halogens (X = Cl, Br, or I), plays a critical role in the global mercury cycle. However, most previously reported mercury compounds are susceptible to reduction, leading to the release of elemental mercury (Hg<sup>0</sup>) and causing secondary pollution. In this study, we unveil a groundbreaking discovery that underscores the vital role of halogenation in creating exceptionally stable Hg<sub>3</sub>Se<sub>2</sub>X<sub>2</sub> compounds. Through the dynamic interplay of Hg, Se, and halogens, an intermediary stage denoted [HgSe]<sub><i>m</i></sub>[HgX<sub>2</sub>]<sub><i>n</i></sub> emerges, and this transformative process significantly elevates the stabilization of mercury. Remarkably, halogen ions strategically occupy pores at the periphery of HgSe clusters, engendering a more densely packed atomic arrangement of Hg, Se, and halogen components. A marked enhancement in both thermal and acid stability is observed, wherein temperatures ascend from 130 to 300 &#176;C (transitioning from HgSe to Hg<sub>3</sub>Se<sub>2</sub>Cl<sub>2</sub>). This sequence of escalating stability follows the order HgSe &lt; Hg<sub>3</sub>Se<sub>2</sub>I<sub>2</sub> &lt; Hg<sub>3</sub>Se<sub>2</sub>Br<sub>2</sub> &lt; Hg<sub>3</sub>Se<sub>2</sub>Cl<sub>2</sub> for thermal resilience, complemented by virtually absent acid leaching. This innovative compound formation fundamentally alters the transformation pathways of gaseous Hg<sup>0</sup> and ionic mercury (Hg<sup>2+</sup>), resulting in highly efficient in situ removal of both Hg<sup>0</sup> and Hg<sup>2+</sup> ions. These findings pave the way for groundbreaking advancements in mercury stabilization and environmental remediation strategies, offering a comprehensive solution through the creation of chemically stable precipitates.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": "pm_18352"}]