[{"context": "Optimizing Surgical Wound Care in Obstetrics and Gynecology.", "source": "Obstetrics and gynecology (OB/GYN) accounts for at least half of all open abdominal surgeries performed. Rates of surgical wound complications after open procedures in OB/GYN range from 5% to 35%. Therefore, optimizing management of surgical wound complications has the potential to significantly reduce cost and morbidity. However, guidelines addressing best practices for wound care in OB/GYN are limited.", "target": "", "edits": [], "_id": "pm_14598"}, {"context": "Novel <i>N</i>-Arylmethyl-aniline/chalcone hybrids as potential VEGFR inhibitors: synthesis, biological evaluations, and molecular dynamic simulations.", "source": "Significant advancements have been made in the domain of targeted anticancer therapy for the management of malignancies in recent times. VEGFR-2 is characterised by its pivotal involvement in angiogenesis and subsequent mechanisms that promote tumour cells survival. Herein, novel <i>N</i>-arylmethyl-aniline/chalcone hybrids <b>5a-5n</b> were designed and synthesised as potential anticancer and VEGFR-2 inhibitors. The anticancer activity was evaluated at the NCI-USA, resulting in the identification of 10 remarkably potent molecules <b>5a-5j</b> that were further subjected to the five-dose assays. Thereafter, they were explored for their VEGFR-2 inhibitory activity where <b>5e</b> and <b>5h</b> emerged as the most potent inhibitors. <b>5e</b> and <b>5h</b> induced apoptosis with cell cycle arrest at the SubG<sub>0</sub>-G<sub>1</sub> phase within HCT-116 cells. Moreover, their impact on some key apoptotic genes was assessed, suggesting caspase-dependent apoptosis. Furthermore, molecular docking and molecular dynamics simulations were conducted to explore the binding modes and stability of the protein-ligand complexes.", "target": "", "edits": [], "_id": "pm_15544"}, {"context": "Fibroids and Fertility.", "source": "Uterine fibroids significantly impact women's reproductive health, influencing fertility potential and pregnancy outcomes. Their growth, often facilitated by hormonal influences like estrogen and progesterone, can cause considerable disruptions in the uterus, leading to symptoms and complications that impact the quality of life and reproductive prospects of women.This article provides an exhaustive discussion of uterine fibroids, including pathophysiology, their impact on endometrial function, receptivity, fertility, and pregnancy outcomes, and the management of infertility in patients with uterine fibroids. It underlines the critical role of uterine fibroids in women's reproductive health, emphasizing the importance of effective diagnosis and treatment to promote fertility and improve pregnancy outcomes.", "target": "", "edits": [], "_id": "pm_1059"}, {"context": "Tricuspid Valve Transcatheter Edge-To-Edge Repair Guidance with Transesophageal Echocardiography and Intracardiac Echocardiography.", "source": "As transcatheter tricuspid interventions have emerged, especially edge-to-edge repair, imaging has shown to be key in optimizing transcatheter outcomes. Given the location of the tricuspid valve relative to the esophagus, transesophageal echocardiography has proven difficult and utilization of three-dimensional (3D) multiplanar reconstruction has become essential. Three-dimensional intracardiac echocardiography is a useful imaging adjunct for tricuspid edge-to-edge repair. As 3D intracardiac echocardiography evolves, it may supplant transesophageal echocardiography as the imaging modality of choice in transcatheter tricuspid valve interventions.", "target": "", "edits": [], "_id": "pm_15101"}, {"context": "A novel MWCNT-encapsulated (2-aminoethyl)piperazine-decorated zinc(II) phthalocyanine composite: development of an electrochemical sensor for detecting the antipsychotic drug promazine in environmental samples.", "source": "A nanocomposite of (2-aminoethyl)piperazine ligand substituted with zinc(II) tetra carboxylic acid phthalocyanine (ZnTEPZCAPC) and MWCNTs was constructed and employed to develop an electrochemical sensor with outstanding sensitivity and a low detection limit. The macrocyclic complex ZnTEPZCAPC was first synthesized and then employed for the electrochemical determination of the antipsychotic drug promazine (PMZ). The as-prepared ZnTEPZCAPC and MWCNT nanocomposite was characterized using different techniques, such as Fourier-transform infrared (FT-IR) spectroscopy, X-ray diffraction (XRD), UV-visible spectroscopy (UV-Vis), field emission scanning electron microscopy (FE-SEM), and thermogravimetric analysis (TGA). Further, the prepared ZnTEPZCAPC@MWCNT nanocomposites were modified on a glassy carbon electrode (GCE) surface, and the electrochemical activity was investigated using cyclic voltammetry (CV), differential pulse voltammetry (DPV), and chronoamperometry (CA) tests in pH 7.0 phosphate buffer solution (PBS) in the potential window of 0.0-1 V. The ZnTEPZCAPC@MWCNTs displayed a superior electrochemical performance because of their high electrochemical active surface area (0.453 cm<sup>2</sup>), good conductivity, and a synergetic effect. The developed electrochemical sensor exhibited a broad linear range of 0.05-635 &#956;M and the lowest detection limit of 0.0125 nM, as well as excellent sensitivity, repeatability, and reproducibility. Finally, the fabricated sensor was successively used for the real-time detection of PMZ in environmental and biological samples and displayed feasible recoveries.", "target": "", "edits": [], "_id": "pm_1554"}, {"context": " <i>In vitro</i> evaluation of cytotoxic potential of essential oil extracted from leaves of <i>Croton heliotropiifolius</i> Kunth in human tumor cells.", "source": "<i>Croton heliotropiifolius</i> Kunth, popularly known as \"velame,\" is a shrub that resides in northeastern Brazil. The essential oil of <i>C. heliotropiifolius</i> contains high concentrations of volatile compounds in the leaves and is widely used in folk medicine for many purposes as an antiseptic, analgesic, sedative, and anti-inflammatory agent. Due to the apparent limited amount of information, the aim of this study was to determine the cytotoxic potential of essential oil extracted from leaves of <i>C. heliotropiifolius</i>, utilizing different human cancer cell lines (HL-60, leukemia; HCT-116, colon; MDA-MB435, melanoma; SF295, glioblastoma) and comparison to murine fibroblast L929 cell line. The chemical characterization of the essential oil revealed the presence of large amounts of monoterpenes and sesquiterpenes, the majority of which were aristolene (22.43%), germacrene D (11.38%), &#611;-terpinene (10.85%), and limonene (10.21%). The essential oil exerted significant cytotoxicity on all cancer cells, with low activity on murine L929 fibroblasts, independent of disruption of cell membranes evidenced by absence of hemolytic activity. The cytotoxicity identified was associated with oxidative stress, which culminated in mitochondrial respiration dysfunction and direct or indirect DNA damage (strand breaks and oxidative damage), triggering cell death via apoptosis. Our findings suggest that extracts of essential oil of <i>C. Heliotropiifolius</i> may be considered as agents to be used therapeutically in treatment of certain cancers.", "target": "", "edits": [], "_id": "pm_3326"}, {"context": "Guideline-Based Follow-Up Outcomes in Patients With Gastrointestinal Stromal Tumor With Low Risk of Recurrence: A Report From the Italian Sarcoma Group.", "source": "Gastrointestinal stromal tumor (GIST) follow-up is recommended by international guidelines, but data on the role of follow-up in patients with low relapse risk are missing. For these patients, the potential benefit of anticipating recurrence detection should be weighed against psychological burden and radiologic examination loads in terms of costs and radiation exposure.", "target": "", "edits": [], "_id": "pm_4054"}, {"context": "Postoperative Metachronous Metastasis of Bladder Cancer to Penis: A Case Report.", "source": "Penile metastases are extremely rare events, originating primarily from primary pelvic tumours of the prostate, bladder, and gastrointestinal tract. The underlying mechanism of bladder cancer metastasis to the penis remains unclear. Metastasis to the penis is usually considered a late manifestation of systemic spread. Therefore, the prognosis of patients with penile metastasis remains poor and their survival period is short. Therefore, reporting this rare case will help to better understand the characteristics, diagnosis, and treatment processes of the disease, with the aim of improving the accuracy and efficiency of diagnosis and treatment.", "target": "", "edits": [], "_id": "pm_10058"}, {"context": "A strong quick-release biointerface in mussels mediated by serotonergic cilia-based adhesion.", "source": "The mussel byssus stem provides a strong and compact mechanically mismatched biointerface between living tissue and a nonliving biopolymer. Yet, in a poorly understood process, mussels can simply jettison their entire byssus, rebuilding a new one in just hours. We characterized the structure and composition of the byssus biointerface using histology, confocal Raman mapping, phase contrast-enhanced microcomputed tomography, and advanced electron microscopy, revealing a sophisticated junction consisting of abiotic biopolymer sheets interdigitated between living extracellular matrix. The sheet surfaces are in intimate adhesive contact with billions of motile epithelial cilia that control biointerface strength and stem release through their collective movement, which is regulated neurochemically. We posit that this may involve a complex sensory pathway by which sessile mussels respond to environmental stresses to release and relocate.", "target": "", "edits": [], "_id": "pm_13651"}, {"context": "More of me: Self-prioritization of numeric stimuli.", "source": "People process stimuli that have been arbitrarily associated with the self versus with a stranger preferentially, but congruence effects can modulate self-prioritization, as when the self is paired with, for example, symmetrical versus asymmetrical stimuli. In two experiments, we examined the interaction of self-prioritization with number magnitude when participants associated the self or a stranger with specific number symbols such as \"2\" presented as natural, negative, and ordinal number types (Experiment 1), or abstract numeric concepts, such as \"larger than 5\" (Experiment 2). Empathy and personal distance were also assessed. While self-prioritization emerged in both experiments, number type (natural, ordinal, and negative) had no effect on performance. Furthermore, correlations with empathy and personal distance did not emerge consistently. An interaction between number magnitude and self-assignment was observed for the magnitude comparison matching task (e.g., > 5) (Experiment 2), but not in the specific number (e.g., \"8\") matching task (Experiment 1). The null interaction may reflect the fact that encoding symbol identity, but not number magnitude, was sufficient for the symbol-matching task. The order of numbers and self-associations also had an effect. In sum, this study is the first to show that self-prioritization emerges for symbolic numbers and can even occur with abstract categories, such as a range of numbers (e.g., > 5). Furthermore, congruence effects between number concepts and labels (e.g., for the stranger, less is better) may also affect performance. However, this would appear to depend on the task context, such as whether numeric magnitude was needed to complete the task. (PsycInfo Database Record (c) 2023 APA, all rights reserved).", "target": "", "edits": [], "_id": "pm_1674"}, {"context": "Era of COVID-19 in Multiple Sclerosis Care.", "source": "The unprecedented scope of the coronavirus disease 2019 (COVID-19) pandemic resulted in numerous disruptions to daily life, including for people with multiple sclerosis (PwMS). This article reviews how disruptions in multiple sclerosis (MS) care prompted innovations in delivery of care (eg, via telemedicine) and mobilized the global MS community to rapidly adopt safe and effective practices. We discuss how our understanding of the risks of COVID-19 in PwMS has evolved along with recommendations pertaining to disease-modifying therapies and vaccines. With lessons learned during the COVID-19 pandemic, we examine potential questions for future research in this new era of MS care.", "target": "", "edits": [], "_id": "pm_15139"}, {"context": "A Case of Stress Cardiomyopathy With Nab-Paclitaxel Infusion.", "source": "Stress cardiomyopathy is a transient left ventricular dysfunction caused by physiologic or pathologic stressors. Anaphylaxis is a hypersensitivity disorder that can lead to a rapid life-threatening respiratory collapse. It happens due to exposure to allergens including medications. During anaphylaxis, there is a compensatory release of catecholamines that can lead to stress cardiomyopathy. In this case, nab-paclitaxel infusion led to anaphylaxis with respiratory failure. Echocardiogram showed features of diffuse hypokinesis with preserved basal segment contractility, and cardiac catheterization did not show any evidence of obstructive coronary artery disease. The overall clinical picture suggested stress cardiomyopathy. The patient was treated with guideline-directed medical therapy which resulted in normalization of the ejection fraction with no symptoms of congestive heart failure at any point. The patient was thereafter resumed on a reduced dose of nab-paclitaxel. This case report adds to the spectrum of infusion-related reactions associated with paclitaxel and demonstrates the course of events in the management of anaphylaxis and stress cardiomyopathy in this scenario.", "target": "", "edits": [], "_id": "pm_2129"}, {"context": "Knowledge, acceptance, motivators and barriers of booster dose of COVID-19 vaccination among dental patients: A cross-sectional study.", "source": "Given the lingering threat of COVID infection, questions are being raised if coronavirus disease 2019 (COVID-19) vaccine needs annual or regular boosters to maintain high levels of immunity against both the original virus and variants. This study was designed to evaluate the knowledge, acceptance, motivators and barriers of the booster dose of COVID-19 vaccine among the dental patients of District Lucknow, India. A total of 297 respondents were selected by a convenience sampling method in this cross-sectional study from various dental clinics. An anonymous, self-administered, closed-ended questionnaire was used. Overall 37.7% respondents reported to have taken all 3 doses and 57.9% had taken single/double doses. Correct information about booster doses shows a significant association with the number of doses taken. The majority had information about the availability of the Pfizer booster vaccine (69.0%). About 58% of participants had information about the technology used in booster doses. The hesitancy for booster doses and the development of natural immunity by infection show significant associations with the number of doses taken. Only 18.2% patients had hesitation about the booster dose and most of them 78.8% recommended others to take the booster vaccine as soon as possible. The majority assumed that previous COVID-19 vaccines can help them get immune (21.5%) followed by not much research has been done on the booster vaccines (15.5%) and their chronic diseases warn them against the booster dose administration (12.5%). Nearly 18.2% of respondents had hesitation about booster dose and less than one third of the respondents trusted a government source for information about booster dose of COVID vaccine. Nearly 36 % did not know that the booster dose of COVID vaccine is available at health centers. Dental health professionals and policymakers should implement and support strategies to ensure people are vaccinated for COVID-19 booster doses.", "target": "", "edits": [], "_id": "pm_9971"}, {"context": "Atypical haemolytic uraemic syndrome in a postpartum patient.", "source": "A postpartum patient presented 1 week following uncomplicated pregnancy and elective repeat caesarean section with acute hypertension, severe anaemia and acute kidney injury. Her workup demonstrated microangiopathic anaemia, thrombocytopenia and liver enzyme elevations. Differential diagnoses included postpartum haemolysis-elevated liver enzyme-low platelet (HELLP) syndrome, haemolytic uraemic syndrome (HUS), and thrombotic thrombocytopenic purpura (TTP). She was treated initially with systemic corticosteroids, haemodialysis and plasmapheresis for presumed TTP while awaiting the results of ADAMSTS13 assay performed at an outside laboratory. When reported back as normal, the diagnosis of atypical HUS was established. Eculizumab was administered with rapid improvement of her condition.", "target": "", "edits": [], "_id": "pm_7661"}, {"context": "Tranexamic Acid for Bleeding Management in Adult Patients on Extracorporeal Membrane Oxygenation.", "source": "This study described the outcomes of patients receiving topical, nebulized, endobronchial, or systemic tranexamic acid (TXA) for bleeding events while on extracorporeal membrane oxygenation (ECMO). We performed a single-center case series including adult patients >18 years old supported on either venovenous (VV) or venoarterial (VA) ECMO from January 1, 2014, to April 21, 2021. The primary outcome was hemostatic control defined as a composite of initial cessation of therapeutic interventions to mitigate bleeding or resumption of anticoagulation if previously held. Secondary outcomes included changes in transfusion requirements and lysis at 30-minute (LY30) values, venous thromboembolism (VTE) events, and seizures. In total, 47 patients were included for full analysis. There were 19 patients with surgical bleeds, 18 patients with medical bleeds, and 10 patients with multiple bleeds. Overall, initial hemostatic control was achieved in 79%, 67%, and 90% of patients, respectively. Pre- and post-TXA transfusion requirements were not significantly different ( p = 0.2), although the intraindividual change in median LY30 was -5.1% compared with baseline (95% confidence interval [CI], -12.4% to -1.5%, p = 0.005). The occurrence of VTE and seizures was relatively low and similar among patient bleeding groups. Tranexamic acid provided initial hemostatic control in roughly three quarters of patients with bleeding events on ECMO and side effects were infrequent.", "target": "", "edits": [], "_id": "pm_875"}, {"context": "Minocycline in depression not responding to first-line therapy: A systematic review and meta-analysis.", "source": "Major depressive disorder is often resistant to first-line treatment, with around 30% failing to respond to traditional therapy. Treatment-resistant depression results in prolonged hospitalization and healthcare costs. Anti-inflammatory drugs have shown promising results in depression not responding to initial therapy. Minocycline has anti-inflammatory properties and crosses the blood-brain barrier. It has demonstrated varied results in several randomized controlled trials (RCTs).", "target": "", "edits": [], "_id": "pm_9944"}, {"context": "The Neurobiology of Trauma: Developing a Decision Aid for the Care of Persons After Sexual Assault.", "source": "The care of the person who has been sexually assaulted is challenging because of the neurobiology of trauma, susceptibility to re-victimization, and time constraints. Everyone involved with their care needs to be cognizant of the psychological-physiological phenomena of trauma in order to provide sensitive, high-quality care to these individuals. The neurobiology of trauma explains why the person's memory may be fragmented or impaired. Trauma-informed care offers choices and empowerment to the person along with safety, cultural awareness, trust, and collaboration. Shared decision making empowers the person by educating them on their care choices in collaboration with the health-care provider. This article discusses the development of a decision aid that supports the information used in shared decision making, for use in planning the care for a person who has been sexually assaulted. Based on the understanding of the neurobiology of trauma, the decision aid incorporates a written tool that provides education and information to prepare the person to make care/treatment decisions which are important to them, within a trauma-informed environment.", "target": "", "edits": [], "_id": "pm_2349"}, {"context": "Age-Related Changes in Inter-Joint Interactions for Global and Local Kinematics While Standing.", "source": "Inter-joint interactions are involved in human standing. These interactions work not only for global kinematics that control the center of mass (COM) of the entire body, but also for local kinematics that control joint angular movements. Age-related changes in these interactions are thought to cause unstable standing postures in older people. Interactions of global kinematics are known to be deficient owing to aging. However, it is unclear whether the interaction of local kinematics is affected by aging. We investigated the age-related changes in inter-joint interactions, especially local kinematics, during standing. Differences were investigated in these two inter-joint interactions between older and younger adults in three different postures: normal, eyes-closed, and foam-surface standings. The inter-joint interaction for local kinematics was computed using the induced-acceleration analysis with a double-inverted pendulum model and quantified using an uncontrolled manifold approach. Consistent with previous studies, the inter-joint interaction for COM acceleration (global kinematics) deteriorated in older adults. In contrast, the interactions for angular accelerations in the ankle and hip joints (local kinematics) were slightly better in the older adults. Moreover, the individual components of angular acceleration which were induced by net torques from homonymous and remote joints were significantly increased in older adults. Thus, global and local inter-joint interactions are driven by distinct neural mechanisms and the interaction of local kinematics can compensate for the increment of each component of joint angular acceleration in older adults.", "target": "", "edits": [], "_id": "pm_604"}, {"context": "Promiscuous Yet Specific: A Methionine-Aromatic Interaction Drives the Reaction Scope of the Family 1 Glycosyltransferase <i>Gm</i>UGT88E3 from Soybean.", "source": "Family 1 glycosyltransferases (GT1s, UGTs) catalyze the regioselective glycosylation of natural products in a single step. We identified <i>Gm</i>UGT88E3 as a particularly promising biocatalyst able to produce a variety of pure, single glycosidic products from polyphenols with high chemical yields. We investigated this particularly desirable duality toward specificity, i.e., promiscuous toward acceptors while regiospecific. Using high-field NMR, kinetic characterization, molecular dynamics simulations, and mutagenesis studies, we uncovered that the main molecular determinant of <i>Gm</i>UGT88E3 specificity is a methionine-aromatic bridge, an interaction often present in protein structures but never reported for enzyme-substrate interactions. Here, mutating Met127 led to inactive proteins or 100-fold reduced activity.", "target": "", "edits": [], "_id": "pm_20702"}, {"context": "Exploring second coordination sphere effects in flavodiiron nitric oxide reductase model complexes.", "source": "Flavodiiron nitric oxide reductases (FNORs) equip pathogens with resistance to nitric oxide (NO), an important immune defense agent in mammals, allowing these pathogens to proliferate in the human body, potentially causing chronic infections. Understanding the mechanism of how FNORs mediate the reduction of NO contributes to the greater goal of developing new therapeutic approaches against drug-resistant strains. Recent density functional theory calculations suggest that a second coordination sphere (SCS) tyrosine residue provides a hydrogen bond that is critical for the reduction of NO to N<sub>2</sub>O at the active site of FNORs [J. Lu, B. Bi, W. Lai and H. Chen, Origin of Nitric Oxide Reduction Activity in Flavo-Diiron NO Reductase: Key Roles of the Second Coordination Sphere, <i>Angew. Chem.</i>, <i>Int. Ed.</i>, 2019, <b>58</b>, 3795-3799]. Specifically, this H-bond stabilizes the hyponitrite intermediate and reduces the energetic barrier for the N-N coupling step. At the same time, the role of the Fe&#8943;Fe distance and its effect on the N-N coupling step has not been fully investigated. In this study, we equipped the H[BPMP] (= 2,6-bis[[bis(2-pyridylmethyl)amino]methyl]-4-methylphenol) ligand with SCS amide groups and investigated the corresponding diiron complexes with 0-2 bridging acetate ligands. These amide groups can form hydrogen bonds with the bridging acetate ligand(s) and potentially the coordinated NO groups in these model complexes. At the same time, by changing the number of bridging acetate ligands, we can systematically vary the Fe&#8943;Fe distance. The reactivity of these complexes with NO was then investigated, and the formation of stable iron(II)-NO complexes was observed. Upon one-electron reduction, these NO complexes form Dinitrosyl Iron Complexes (DNICs), which were further characterized using IR and EPR spectroscopy.", "target": "", "edits": [], "_id": "pm_5976"}, {"_thresh_template": "# As fine-grained annotation requires complex categories, many successful fine-grained \n# typologies organize their classification in trees. Our interface is unique in that it can \n# render any arbitrary annotation tree, no matter its depth or breath. We will begin with \n# simple annotation setups, and then showcase some complex examples.\n\n# Click the Instructions button to view this :)\n\ninstructions: |\n  ## Adding instructions to your interface\n  Instructions are formatted with [Markdown](https://www.markdownguide.org/cheat-sheet/). \n  You can use the `prepend_instructions` argument to display this text above the interface, or have an \"Instructions\" button.\n\n  ### Formatting\n  Markdown allows creating **bold** or *italicized* text and:\n  - lists\n  - of\n  - items\n\n  ```\n  You can even add blocks of code\n  ```\n  ---\n\n# Comment this to package the instructions using an \"Instructions\" button\n# prepend_instructions: true\n\n# ========================================================================================\n# ========================================================================================\n\n\nedits:\n  # You can specify any number of individual questions\n  - name: multi_question\n    label: \"Annotate Term\"\n    enable_input: true\n    color: blue\n    icon: fa-pen\n    type: single_span\n    annotation:\n      - name: defn_question\n        label: \"Definition\"\n        question: \"Write a one-sentence definition of this term. If you wish to use Google, please use the following search format `define:\\\"<term>\\\"`, substituting your identified term for `<term>` (make sure to include the quotation marks).\"\n        options: textarea\n      - name: difficulty_question\n        label: \"Difficulty\"\n        question: \"How difficult is defining this term?\"\n        options: likert-3\n      - name: category_question\n        label: \"Category\"\n        question: \"Which category would you this term to?\"\n        options: \n          - name: a1\n            label: \"Concept/phrase\"\n          - name: a2\n            label: \"Abbreviation\"\n          - name: a3\n            label: \"Named Entity\"\n          # - name: child_4\n          #   label: \"Other\"\n      - name: multisense_question\n        label: \"Multisense\"\n        question: \"Does this term have different meanings in other domain contexts? If you're uncertain, choose 'Unsure'.\"\n        options: \n          - name: b1\n            label: \"Yes\"\n          - name: b2\n            label: \"No\"\n          - name: b3\n            label: \"Unsure\"\n\n\n\n# ========================================================================================\n# ========================================================================================\n\ntemplate_name: llm_dfs\ntemplate_label: Scientific Concept Identification & Definition\ntemplate_description: TODO\n\n\ndisplay:\n - side-by-side         # shows text and editor next to each other\n#  - text-side-by-side    # shows source and target next to each other\n#  - disable-lines        # disables lines between annotations which can be distracting\n#  - hide-context         # hides the context by default, adding a \"show context\" button\n\ndisable:\n- download        # Disables data download, useful for crowdsourcing\n# - upload          # Disables data upload, useful if data is provided with ?d= parameter\n# - selection     # Disables edit selection\n# - annotation      # Disables edit annotation"}]