[{"context": "Minkowski Functionals for composite smooth random fields", "source": "Minkowski functionals quantify the morphology of smooth random fields. They are widely used to probe statistical properties of cosmological fields. Analytic formulae for ensemble expectations of Minkowski functionals are well known for Gaussian and mildly non-Gaussian fields. In this paper we extend the formulae to composite fields which are sums of two fields and explicitly derive the expressions for the sum of uncorrelated mildly non-Gaussian and Gaussian fields. These formulae are applicable to observed data which is usually a sum of the true signal and one or more secondary fields that can be either noise, or some residual contaminating signal. Our formulae provide explicit quantification of the effect of the secondary field on the morphology and statistical nature of the true signal. As examples, we apply the formulae to determine how the presence of Gaussian noise can bias the morphological properties and statistical nature of Gaussian and non-Gaussian CMB temperature maps.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.12571}, {"context": "Gamma-ray emission from the Seyfert galaxy NGC 4151 and multimessenger\n  implications for ultra-fast outflows", "source": "The enhanced activity typical of the core of Seyfert galaxies can drive powerful winds where high-energy phenomena can occur. In spite of their high power content, the number of such non-jetted active galactic nuclei (AGN) detected in gamma rays is very limited. In this Letter, we report the identification and measurement of the gamma-ray flux from NGC 4151, a Seyfert galaxy located at about 15.8 Mpc. The source is known for hosting ultra-fast outflows (UFOs) in its innermost core through X-ray spectroscopic observations, thereby becoming the first UFO host ever recognized in gamma rays. UFOs are mildly relativistic, wide opening angle winds detected in the innermost parsecs of active galaxies where strong shocks can develop. We interpret the gamma-ray flux as a result of diffusive shock acceleration at the wind termination shock of the UFO and inelastic hadronic collisions in its environment. Interestingly, NGC 4151 is also spatially coincident with a weak excess of neutrino events identified by the IceCube neutrino observatory. We compute the contribution of the UFO to such a neutrino excess and we discuss other possible emission regions such as the AGN corona.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2303.03298}, {"context": "Quijote-PNG: The Information Content of the Halo Mass Function", "source": "We study signatures of primordial non-Gaussianity (PNG) in the redshift-space halo field on non-linear scales, using a combination of three summary statistics, namely the halo mass function (HMF), power spectrum, and bispectrum. The choice of adding the HMF to our previous joint analysis of power spectrum and bispectrum is driven by a preliminary field-level analysis, in which we train graph neural networks on halo catalogues to infer the PNG $f_\\mathrm{NL}$ parameter. The covariance matrix and the responses of our summaries to changes in model parameters are extracted from a suite of halo catalogues constructed from the Quijote-PNG N-body simulations. We consider the three main types of PNG: local, equilateral and orthogonal. Adding the HMF to our previous joint analysis of power spectrum and bispectrum produces two main effects. First, it reduces the equilateral $f_\\mathrm{NL}$ predicted errors by roughly a factor $2$, while also producing notable, although smaller, improvements for orthogonal PNG. Second, it helps break the degeneracy between the local PNG amplitude, $f_\\mathrm{NL}^\\mathrm{local}$, and assembly bias, $b_{\\phi}$, without relying on any external prior assumption. Our final forecasts for PNG parameters are $\\Delta f_\\mathrm{NL}^\\mathrm{local} = 40$, $\\Delta f_\\mathrm{NL}^\\mathrm{equil} = 210$, $\\Delta f_\\mathrm{NL}^\\mathrm{ortho} = 91$, on a cubic volume of $1 \\left( {\\rm Gpc}/{\\rm h} \\right)^3$, with a halo number density of $\\bar{n}\\sim 5.1 \\times 10^{-5}~h^3\\mathrm{Mpc}^{-3}$, at $z = 1$, and considering scales up to $k_\\mathrm{max} = 0.5~h\\,\\mathrm{Mpc}^{-1}$.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2305.10597}, {"context": "Note concerning a high spectral resolution slicer for imaging\n  spectro-polarimetry with the new generation Multichannel Subtractive Double\n  Pass (MSDP) onboard the future EST telescope", "source": "Imaging spectroscopy is intended to be coupled with adaptive optics (AO) on large telescopes, such as EST, in order to produce high spatial and temporal resolution measurements of velocities and magnetic fields upon a 2D FOV. We propose a high spectral resolution slicer (30 m{\\AA} typical) for the Multichannel Subtractive Double Pass (MSDP) of the future European Solar Telescope (EST), using a new generation slicer for thin photospheric lines such as FeI (56 channels, 0.13 mm step) which will benefit of AO and existing polarimeters. The aim is to reconstitute cubes of instantaneous data (X, Y, lambda) at high cadence, allowing the study of the photospheric dynamics and magnetic fields.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.05225}, {"context": "Dancing with the stars: a review on stellar multiplicity", "source": "Stars like company. They are mostly formed in clusters and their lives are often altered by the presence of one or more companions. Interaction processes between components may lead to complex outcomes like Algols, blue stragglers, chemically altered stars, type Ia supernovae, as well as progenitors of gravitational wave sources, to cite a few. Observational astronomy has entered the era of big data, and thanks to large surveys like spatial missions Kepler, TESS, Gaia, and ground-based spectroscopic surveys like RAVE, Gaia-ESO, APOGEE, LAMOST, GALAH (to name a few) the field is going through a true revolution, as illustrated by the recent detection of stellar black holes and neutron stars as companions of massive but also low-mass stars. In this review, I will present why it is important to care about stellar multiples, what are the main large surveys in which many binaries are harvested, and finally present some features related to the largest catalogue of astrometric, spectroscopic and eclipsing binaries provided by the Non-Single Star catalogue of Gaia, which is, to date, the largest homogeneous catalogue of stellar binaries.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.09764}, {"context": "Wake Interference Effects on Flapping Dynamics of Elastic Inverted Foil", "source": "Using high-fidelity simulations, we study the self-induced flapping dynamics of an inverted elastic foil when it is placed in tandem with a stationary circular cylinder. The effect of wake interference on the inverted foil's coupled dynamics is systematically examined at a fixed $Re$ as a function of non-dimensional bending rigidity ($K_{B}$) and the structure to fluid mass ratio ($m^{*}$). Our results show that the inverted foil experiences a relatively higher transverse fluid loading under unsteady wake flow. Consequently, flapping instability is induced at a higher $K_{B}$ value as compared to an isolated foil. There exists a critical $K_{B, Cr} = 0.25$, above which the downstream foil is synchronized with the unsteady wake, and the cylinder controls the flapping response and the wake vortex dynamics. During synchronization, two additional flapping modes are observed as a function of decreasing $K_{B}$, namely small amplitude flapping and moderate amplitude flapping modes. Below $K_{B, Cr}$, the downstream foil undergoes self-induced large-amplitude flapping similar to an isolated foil counterpart. Interestingly, unlike an isolated inverted foil, in the tandem setup, the flapping dynamics are strongly influenced by both $K_{B}$ and $m^{*}.$ The findings from this study aim to generalize our understanding of the self-induced flapping dynamics of inverted foils and have relevance to the development of inverted foil-based renewable energy harvesters.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.09339}, {"context": "Twin Strouhal numbers in pressure loading of circular cylinder at high\n  Reynolds numbers", "source": "We present a wind tunnel experiment on a large smooth circular cylinder mounted between walls. The Reynolds number range of interest is [800 000 : 2 170 000]. This low supercritical regime is often encountered in wind engineering applications, especially the excitation of flexible circular structures by vortex shedding. Main measurements are the unsteady wall pressure distributions around the cylinder by means of synchronized pressure taps with high resolution in time and space. By using the bi-orthogonal decomposition of this set of signals, twin Strouhal numbers are detected which correspond to the second and the fourth terms of the decomposition. These terms are found to produce the unsteady lift on the cylinder with a main contribution of the second one for which the associated Strouhal number is close to the one usually found at subcritical Reynolds numbers.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.10486}, {"context": "Magneto-Stokes Flow in a Shallow Free-Surface Annulus", "source": "We analyse a magnetohydrodynamic flow inspired by the kinematic reversibility of viscous Taylor-Couette flows. The system considered here shares the cylindrical-annular geometry of the Taylor-Couette cell, but uses applied electromagnetic forces to drive \"magneto-Stokes\" flow in a shallow, free-surface layer of electrolyte. An analytical solution is presented and validated with coupled laboratory and numerical experiments. The dominant balance of Lorentz forcing and basal viscous drag reproduces the kinematic reversibility observed by G.I. Taylor with precise electromagnetic control. Induced fluid deformation may be undone by simply reversing the polarity of electric current through the system. We illustrate this analogy with theory and experiment, and we draw a further connection to potential flow using the Hele-Shaw approximation. The stability and controllability of the magneto-Stokes system make it an attractive tool for investigating shear flows in a variety of settings from industrial to astrophysical. In addition, the set-up's simplicity and robustness make magneto-Stokes flow a good candidate for PIV calibration and for educational demonstrations of magnetohydrodynamics, boundary layers, and flow transition.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.10882}, {"context": "Split-explicit external mode solver in finite volume sea ice ocean model\n  FESOM2", "source": "A novel split-explicit (SE) external mode solver for the Finite volumE Sea ice-Ocean Model (FESOM2) is presented. It is compared with the semi-implicit (SI) solver currently used in FESOM2. The SE solver utilises a dissipative asynchronous (forward-backward) time-stepping scheme. Its implementation with Arbitrary Lagrangian-Eulerian (ALE) vertical coordinates like Z-star and Z-tilde is explored. The comparisons are performed through multiple test cases involving idealised and realistic global simulations. The SE solver demonstrates lower phase errors and dissipation, but maintain a simulated mean ocean state very similar to the SI solver. The SE solver is also shown to possess better run-time performance and parallel scalability across all tested workloads.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.08241}, {"context": "Are the ultra-high-redshift galaxies at z > 10 surprising in the context\n  of standard galaxy formation models?", "source": "A substantial number of ultra-high redshift (8 < z < 17) galaxy candidates have been detected with JWST, posing the question: are these observational results surprising in the context of current galaxy formation models? We address this question using the well-established Santa Cruz semi-analytic models, implemented within merger trees from the new suite of cosmological N-body simulations GUREFT, which were carefully designed for ultra-high redshift studies. Using our fiducial models calibrated at z=0, we present predictions for stellar mass functions, rest-frame UV luminosity functions, and various scaling relations. We find that our (dust-free) models predict galaxy number densities at z~11 (z~13) that are an order of magnitude (a factor of ~30) lower than the observational estimates. We estimate the uncertainty in the observed number densities due to cosmic variance, and find that it leads to a fractional error of ~20-30% at z=11 (~30-80% at z=14) for a 100 sq arcmin field. We explore which processes in our models are most likely to be rate-limiting for the formation of luminous galaxies at these early epochs, considering the halo formation rate, gas cooling, star formation, and stellar feedback, and conclude that it is mainly efficient stellar-driven winds. We find that a modest boost of a factor of ~4 to the UV luminosities, which could arise from a top-heavy stellar initial mass function, would bring our current models into agreement with the observations. Adding a stochastic component to the UV luminosity can also reconcile our results with the observations.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2304.04348}]