[{"context": "Magnetic-Reconnection-Heated Corona Model: Implication of Hybrid\n  Electrons for Hard X-ray Emission of Luminous Active Galactic Nuclei", "source": "It is widely accepted that X-ray emission in luminous active galactic nuclei (AGNs) originates from hot corona. To prevent the corona from over-cooling by strong X-ray emission, steady heating to the corona is essential, for which the most promising mechanisms is the magnetic reconnection. Detailed studies of the coupled disc and corona, in the frame of magnetic field transferring accretion-released energy from the disc to the corona, reveal that the thermal electrons can only produce X-ray spectrum with $\\Gamma_{\\rm 2-10\\,keV}>2.1$, which is an inevitable consequence of the radiative coupling of the thermal corona and disc. In the present work, we develop the magnetic-reconnection-heated corona model by taking into account the potential non-thermal electrons accelerated in the magnetic reconnection process, in addition to the thermal electrons. We show that the features of the structure and spectrum of the coupled disc and corona can be affected by the fraction of magnetic energy allocated to thermal electrons. Furthermore, we investigate the effects of the power-law index and energy range of non-thermal electrons and the magnetic field on the spectrum. It is found that the X-ray spectrum from the Comptonization of the hybrid electrons can be flatter than that from thermal electrons only, in agreement with observations. By comparing with the observed hard X-ray data, we suggest that a large fraction ($>40\\%$) of the magnetic energy be allocated to the non-thermal electrons in the luminous and flat X-ray spectrum AGNs.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.13135}, {"context": "Can comets deliver prebiotic molecules to rocky exoplanets?", "source": "In this work we consider the potential of cometary impacts to deliver complex organic molecules and the prebiotic building blocks required for life to rocky exoplanets. Numerical experiments have demonstrated that for these molecules to survive, impacts at very low velocities are required. This work shows that for comets scattered from beyond the snow-line into the habitable zone, the minimum impact velocity is always lower for planets orbiting Solar-type stars than M-dwarfs. Using both an analytical model and numerical N-body simulations, we show that the lowest velocity impacts occur onto planets in tightly-packed planetary systems around high-mass (i.e. Solar-mass) stars, enabling the intact delivery of complex organic molecules. Impacts onto planets around low-mass stars are found to be very sensitive to the planetary architecture, with the survival of complex prebiotic molecules potentially impossible in loosely-packed systems. Rocky planets around M-dwarfs also suffer significantly more high velocity impacts, potentially posing unique challenges for life on these planets. In the scenario that cometary delivery is important for the origins of life, this study predicts the presence of biosignatures will be correlated with i) decreasing planetary mass (i.e. escape velocity), ii) increasing stellar-mass, and iii) decreasing planetary separation (i.e. exoplanets in tightly-packed systems).", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2310.12906}, {"context": "The Simons Observatory: Large-Scale Characterization of 90/150 GHz TES\n  Detector Modules", "source": "The Simons Observatory (SO) is a cosmic microwave background instrumentation suite being deployed in the Atacama Desert in northern Chile. The telescopes within SO use three types of dichroic transition-edge sensor (TES) detector arrays, with the 90 and 150 GHz Mid-Frequency (MF) arrays containing 65% of the approximately 68,000 detectors in the first phase of SO. All of the 26 required MF detector arrays have now been fabricated, packaged into detector modules, and tested in laboratory cryostats. Across all modules, we find an average operable detector yield of 84% and median saturation powers of (2.8, 8.0) pW with interquartile ranges of (1, 2) pW at (90, 150) GHz, respectively, falling within their targeted ranges. We measure TES normal resistances and superconducting transition temperatures on each detector wafer to be uniform within 3%, with overall central values of 7.5 mohm and 165 mK, respectively. Results on time constants, optical efficiency, and noise performance are also presented and are consistent with achieving instrument sensitivity forecasts.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.05583}, {"context": "Broadband non-thermal emission of odd radio circles induced by galactic\n  outflow remnants and their evolution", "source": "Odd radio circles (ORCs) are mysterious rings of faint, diffuse emission recently discovered in radio surveys. Some are potentially associated with galaxies, and proposed to be synchrotron emission from remnants of galactic outflows, which we call OGREs. Assuming that ORCs arise from OGREs, we discuss the broadband non-thermal emission and their evolution. We posit that a large amount of energy was ejected from the central galaxy in the past, creating an outgoing shock where cosmic rays are accelerated. From the observed spectral index and size of the ORCs, we estimate the shock velocity and the injected energy. For reasonable values of the magnetic field and temperature of the ambient medium, we find that the ejected energy is required to be as high as ~10^60 erg to account for the observed radio power, suggesting that the energy source is active galactic nuclei. We also calculate the spectral energy distributions (SEDs) of the OGREs and their evolution, including synchrotron, inverse Compton (IC) and bremsstrahlung emission from electrons, and pion-decay emission from protons. Younger OGREs are expected to have SEDs with synchrotron and IC peaks in the soft X-ray and gamma-ray bands, respectively. In the future, they may be detectable at radio and higher frequencies, for example as ``odd X-ray circles''. In addition, infrared IC emission may be observable from some of the ORCs found so far. Future broadband observations of ORCs should provide not only critical tests of this model, but may also offer unique probes of feedback effects on circumgalactic scales.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.12099}, {"context": "Cosmology with Galaxy Cluster Properties using Machine Learning", "source": "[Abridged] Galaxy clusters are the most massive gravitationally-bound systems in the universe and are widely considered to be an effective cosmological probe. We propose the first Machine Learning method using galaxy cluster properties to derive unbiased constraints on a set of cosmological parameters, including Omega_m, sigma_8, Omega_b, and h_0. We train the machine learning model with mock catalogs including \"measured\" quantities from Magneticum multi-cosmology hydrodynamical simulations, like gas mass, gas bolometric luminosity, gas temperature, stellar mass, cluster radius, total mass, velocity dispersion, and redshift, and correctly predict all parameters with uncertainties of the order of ~14% for Omega_m, ~8% for sigma_8, ~6% for Omega_b, and ~3% for h_0. This first test is exceptionally promising, as it shows that machine learning can efficiently map the correlations in the multi-dimensional space of the observed quantities to the cosmological parameter space and narrow down the probability that a given sample belongs to a given cosmological parameter combination. In the future, these ML tools can be applied to cluster samples with multi-wavelength observations from surveys like LSST, CSST, Euclid, Roman in optical and near-infrared bands, and eROSITA in X-rays, to constrain both the cosmology and the effect of the baryonic feedback.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2304.09142}, {"context": "Aerodynamic drag reduction of a tilt rotor aircraft using\n  zero-net-mass-flux devices", "source": "The study described in this paper was conducted as part of the European Funded CleanSky2 project AFC4TR (Active Flow Control for Tilt-Rotor aircraft). High Fidelity numerical simulations were made to study various approaches of using Active Flow Control (AFC) actuators to delay flow separation at near stall conditions of the Next Generation Civil Tilt Rotor (NGCTR) VTOL aircraft with a tilted nacelle used during take-off and landing. The study revealed that for this configuration the flow separations travel in the spanwise direction starting from the middle of the wing. Various flow control strategies using Zero Net Mass Flux (ZNMF) actuators (synthetic jets) were then tested. Different number of actuators were integrated on the wing at different positions in order to optimize the effectiveness of these devices. It was found that when placed correctly, using the optimal blowing velocity and actuation frequency, ZNMF devices help to delay flow separation, resulting in a reduction of pressure drag and an increase in the aircraft's aerodynamic efficiency.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2310.20023}, {"context": "The Critical Role of Isopotential Surfaces for Magnetostatic\n  Ponderomotive Forces", "source": "By producing localized wave regions at the ends of an open-field-line magnetic confinement system, ponderomotive walls can be used to differentially confine different species in the plasma. Furthermore, if the plasma is rotating, this wall can be magnetostatic in the lab frame, resulting in simpler engineering and better power flow. However, recent work on such magnetostatic walls have shown qualitatively different potentials than those found in the earlier, non-rotating theory. Here, using a simple slab model of a ponderomotive wall, we resolve this discrepancy. We show that the form of the ponderomotive potential in the co-moving plasma frame depends on the assumption made about the electrostatic potential in the lab frame. If the lab-frame potential is unperturbed by the magnetic oscillation, one finds a parallel-polarized wave in the co-moving frame, while if each field line remains equipotential throughout the perturbation region, one finds a perpendicularly-polarized wave. This in turn dramatically changes the averaged ponderomotive force experienced by a charged particle along the field line: not only its scaling, but also its direction.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2305.09768}, {"context": "Numerical investigation of effective nonlinear coefficient model for\n  coupled third harmonic generation", "source": "In this paper, the optimal solution of effective nonlinear coefficient of quasi-phase-matching (QPM) crystals for coupled third harmonic generation (CTHG) was numerically investigated. The effective nonlinear coefficient of CTHG was converted to an Ising model for optimizing domain length distributions of aperiodically poled lithium niobate (APPLN) crystals with lengths as 0.5 mm and 1 mm, and fundamental wavelengths ranging from 1000 nm to 6000 nm. A method for reconstructing crystal domain poling weight curve of coupled nonlinear processes was also proposed, which demonstrated the optimal conversion ratio between two coupled nonlinear processes at each place along the crystal. In addition, by applying the semidefinite programming, the upper bound on the effective nonlinear coefficients deff for different fundamental wavelengths were calculated. The research can be extended to any coupled dual \\c{hi}(2) process and will help us to understand better the dynamics of coupled nonlinear interactions based on QPM crystals.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2311.13426}, {"context": "Topological light guiding and trapping via shifted photonic crystal\n  interfaces", "source": "Photonic crystals (PCs) are periodic dielectric structures that severed as an excellent platform to manipulate light. A conventional way to guide/trap light via PCs is to introduce a line or point defect by removing or modifying several unit cells. Here we show that the light can be effectively guided and trapped in the glided photonic crystal interfaces (GPCIs). The projected band gap of GPCIs, which depends on the glide parameter, is characterized by a Dirac mass. Interestingly, the GPCIs with zero Dirac mass is a glide-symmetric waveguide featured with excellent transmission performance even in the presence of sharp corners and disorders. Moreover, placing two GPCIs with opposite Dirac mass together results in a photonic bound state due to the Jackiw-Rebbi theory. Our work provides an alternative way towards the design of ultracompact photonic devices such as GPCIs-induced coupled cavity-waveguide system and waveguide splitter.", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2309.09745}, {"context": "NOEMA reveals the true nature of luminous red JWST z>10 galaxy\n  candidates", "source": "The first year of JWST has revealed a surprisingly large number of luminous galaxy candidates beyond $z>10$. While some galaxies are already spectroscopically confirmed, there is mounting evidence that a subsample of the candidates with particularly red inferred UV colors are in fact lower redshift contaminants.These interlopers are often found to be `HST-dark' or `optically-faint' galaxies at $z\\sim2-6$, a population key to understanding dust-obscured star formation throughout cosmic time. This paper demonstrates the complementarity of ground-based mm-interferometry and JWST infrared imaging to unveil the true nature of red 1.5-2.0 $\\mu$m dropouts that have been selected as ultra-high-redshift galaxy candidates. We present NOEMA Polyfix follow-up observations of four JWST red 1.5-2.0 $\\mu$m dropouts selected by Yan et al. 2023 as ultra-high-redshift candidates in the PEARLS field. The new NOEMA observations constrain the rest-frame far-infrared continuum emission and efficiently discriminate between intermediate- and high-redshift solutions. We report $>10\\sigma$ NOEMA continuum detections of all our target galaxies at observed frequencies of $\\nu$=236 and 252 GHz, with FIR slopes indicating a redshift $z<5$. We model their optical-to-FIR spectral energy distribution (SED) with multiple SED codes, and find that they are not $z>10$ galaxies but instead dust-obscured, massive star-forming galaxies at $z\\sim 2-4$. The contribution to the cosmic star-formation rate density of such sources is not negligible at $z\\simeq 3.5$ ($\\phi\\gtrsim(1.9-4.4)\\times10^{-3}\\ \\rm{cMpc}^{-3}$), in line with previous studies of optically-faint/sub-millimeter galaxies. This work showcases a new way to select intermediate- to high-redshift dust-obscured galaxies in JWST fields with minimal wavelength coverage to open a new window on obscured star-formation at intermediate redshifts .[abridged]", "target": "", "edits": [{"category": "overall_comments", "id": 1, "annotation": null}], "_id": 2310.20675}]